emacs/.emacs.d/README.org
#+TITLE: My GNU Emacs Configuration
#+DATE: Wednesday, September 25, 2024
#+PROPERTY: header-args:emacs-lisp :results silent :mkdirp yes
#+STARTUP: overview

* Introduction
:PROPERTIES:
:visibility: folded
:END:

This is my literate Emacs configuration file. It serves as both documentation
and the source for configuring Emacs. All necessary files to configure Emacs
are generated from this file by calling ~org-babel-tangle~ (~C-c C-v t~) and stored
in the =/modules= sub-directory. As such, changes should be made in this
document, not in the individual =.el= files.

*N.B.* This configuration uses ~setopt~, introduced in Emacs 29.1, in preference to ~setq~.

* Common Library Header
:PROPERTIES:
:visibility: folded
:ID:       33dd0e1d-425b-4bb9-8a23-398884c046b8
:END:

Copied from [[https://github.com/MArpogaus/emacs.d/blob/master/emacs.org#common-header-for-emacs-libraries][github.com/MArpogaus]].

*N.B.* According to the [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-File.html][Emacs manual]], byte-compiling the init does not speed-up
startup very much, and often leads to problems when you forget to recompile the
file. Also, from my experience, it may lead to bugs that do not happen when not
using byte-compile.

#+NAME: header
#+begin_src shell :var FILENAME="init.el" :results output
echo ";;; $FILENAME --- Emacs configuration file  -*- lexical-binding: t; no-byte-compile: t -*-
;; Copyright (C) 2024-$(date +%Y) Jonathan A. Harris

;; Author: Jonathan A. Harris, MSc.
;; Keywords: configuration
;; Homepage: https://github.com/jah377/dotfiles

;; This file is not part of GNU Emacs.

;;; Commentary:

;; This file has been generated from 'README.org'. DO NOT EDIT.

;; Changes to the configuration should be done in 'README.org' and then
;; re-tangled by calling 'C-c C-v C-t'.

;;; Code:"
#+end_src

* Early Init File
:PROPERTIES:
:header-args: :tangle early-init.el
:END:

The =early-init.el= file, introduced with Emacs27, is the first file that Emacs
reads when starting up. In principal, the early initialization file should
set-up a few basic things before Emacs produces the initial frame, and should
not depend on any packages.

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="early-init.el")>>
#+end_src

** TODO Define Cloud Storage Location

#+begin_src emacs-lisp
(setq user-cloud-path (format "/Users/%s/Library/CloudStorage/ProtonDrive-harris.jon@proton.me-folder/"
                              user-login-name)
      user-settings-path (expand-file-name "emacs_settings" user-cloud-path))

;; Create user-store-path if it does not already exist in the cloud
(if (not (file-directory-p user-cloud-path))
    (error (format "Does not exist: user-cloud-path=%s" user-cloud-path))
  (if (file-directory-p user-settings-path)
      (message "user-settings-path already exists")
    (make-directory user-settings-path)))
#+end_src

** Temporarily Configure Garbage Collection
:PROPERTIES:
:ID:       19407840-a20f-4225-9484-bbf88d3ff00d
:END:

=gc-cons-threshold= setting controls the number of bytes required to trigger
garbage collection (GC); =gc-cons-percentage= related. Setting to
~most-positive-fixnum~ effectively disables GC, which significantly affects
startup times.

Values are lowered after startup to prevent freezing or crashing.

*Source:*
+ [[https://github.com/doomemacs/doomemacs/blob/master/early-init.el#L29][github.com/doomemacs/early-init.el]]
+ [[https://github.com/nilcons/emacs-use-package-fast#a-trick-less-gc-during-startup][github.com/nilcons/emacs-use-package-fast#a-trick-less-gc-during-startup]]

#+begin_src emacs-lisp
(setq gc-cons-threshold most-positive-fixnum)
(setq gc-cons-percentage 0.6)

;; Restore after startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (setopt gc-cons-threshold (* 16 1024 1024))))

;; Perform GC after startup
(add-hook 'emacs-startup-hook (lambda () (garbage-collect)))
#+end_src

** Disable Frame Resizing

=frame-inhibit-implied-resize= setting, when set to ~t~, prevents Emacs from
automatically resizing the frame during the initialization process.

Configuring visual elements like font or fringes may trigger Eamcs to resize
the frame in order to preserver a number of columns or lines it
displays. Resizing can be a terribly expensive part of changing the font. By
inhibiting this, it is possible to reduce startup times with fonts that are
larger than the system default.

*Source:*
+ [[https://tony-zorman.com/posts/emacs-potpourri.html][A Potpourri of Emacs Tweaks]]
+ [[https://github.com/DamienCassou/emacs.d/blob/master/early-init.el#L25][github.com/DamienCassou]]
+ [[https://github.com/MArpogaus/emacs.d?tab=readme-ov-file#optimize-startup-time][github.com/MArpogaus]]

*IMPORTANT:* This should be configured before [[id:534b1a9a-e956-42b1-bf81-40b4e82b2c8e][Disable UI Elements]] and [[id:1360c936-229c-44fd-b71c-30f66960d23a][UI]] sections

#+begin_src emacs-lisp
(setopt frame-inhibit-implied-resize t)
#+end_src

Similarly, =frame-resize-pixelwise= setting, when set to ~t~, disables Emacs from
resizing the frame when changing fonts. Doing so /allegedly/ improves startup
times when fonts are larger than the system default.

*Source:*
+ [[https://github.com/jamescherti/minimal-emacs.d/blob/main/init.el][github/jamescherti/minimal-emacs.d]]

#+begin_src emacs-lisp
(setopt frame-resize-pixelwise t)
#+end_src

** Disable UI Elements
:PROPERTIES:
:ID:       534b1a9a-e956-42b1-bf81-40b4e82b2c8e
:END:

Remove unnecessary visual elements not only enhances the aesthetics but also
improves startup speed.

#+begin_src emacs-lisp
(menu-bar-mode   -1) ; Menu bar at top of framen
(scroll-bar-mode -1) ; Visible scroll-bar that appears when scrolling
(scroll-all-mode -1) ; Visible scroll-bar during synchronized scrolling
(tool-bar-mode   -1) ; Icons like "save" button below menu
(tooltip-mode    -1) ; Hoving over (some) elements triggers pop-up boxes
#+end_src

#+begin_src emacs-lisp
(setq-default initial-major-mode 'text-mode
              inhibit-startup-echo-area-message t ; Disable initial echo message
              inhibit-startup-message t    ; Disable startup message
              inhibit-startup-screen t     ; Disable start-up screen
              inhibit-splash-screen t      ; Disable startup screens/messages
              initial-scratch-message nil  ; Empty '*scratch*' buffer
              initial-buffer-choice t)     ; Open '*scratch*' buffer
#+end_src

** Disable (Some) Warnings

=warning-suppress-types= setting controls the messages sent to =*Warnings*=
buffer. Here, we ignore warnings about "existing variables being aliased",
which are triggered when Emacs packages do not come with =lexical-bindings=.

*Source:*
+ [[https://github.com/Thaodan/emacs.d][github.com/Thaodan]]
+ [[https://github.com/MArpogaus/emacs.d?tab=readme-ov-file#optimize-startup-time][github.com/MArpogaus]]

#+begin_src emacs-lisp
(setopt warning-suppress-types '((defvaralias) (lexical-binding)))
#+end_src

*N.B.* Including ~;; -*- lexical-binding: t; -*-~ at the top of Emacs lisp files is
essential for controlling how variable bindings work in the code.

