emacs/.emacs.d/early-init.el
;;; early-init.el --- Emacs configuration file  -*- lexical-binding: t; no-byte-compile: t -*-
;; Copyright (C) 2024-2025 Jonathan A. Harris

;; Author: Jonathan A. Harris, MSc.
;; Keywords: configuration
;; Homepage: https://github.com/jah377/dotfiles

;; This file is not part of GNU Emacs.

;;; Commentary:

;; This file has been generated from 'README.org'. DO NOT EDIT.

;; Changes to the configuration should be done in 'README.org' and then
;; re-tangled by calling 'C-c C-v C-t'.

;;; Code:

  (setq user-cloud-path "/Users/jonathanharris/Library/CloudStorage/ProtonDrive-harris.jon@proton.me-folder/"
        user-settings-path (expand-file-name "emacs_settings" user-cloud-path))

  ;; Create user-store-path if it does not already exist in the cloud
    (unless (file-directory-p user-settings-path)
      (make-directory user-settings-path))

(setq gc-cons-threshold most-positive-fixnum)
(setq gc-cons-percentage 0.6)

;; Restore after startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (setopt gc-cons-threshold (* 16 1024 1024))))

;; Perform GC after startup
(add-hook 'emacs-startup-hook (lambda () (garbage-collect)))

(setopt frame-inhibit-implied-resize t)

(setopt frame-resize-pixelwise t)

(menu-bar-mode   -1) ; Menu bar at top of framen
(scroll-bar-mode -1) ; Visible scroll-bar that appears when scrolling
(scroll-all-mode -1) ; Visible scroll-bar during synchronized scrolling
(tool-bar-mode   -1) ; Icons like "save" button below menu
(tooltip-mode    -1) ; Hoving over (some) elements triggers pop-up boxes

(setq-default initial-major-mode 'text-mode
              inhibit-startup-echo-area-message t ; Disable initial echo message
              inhibit-startup-message t    ; Disable startup message
              inhibit-startup-screen t     ; Disable start-up screen
              inhibit-splash-screen t      ; Disable startup screens/messages
              initial-scratch-message nil  ; Empty '*scratch*' buffer
              initial-buffer-choice t)     ; Open '*scratch*' buffer

(setopt warning-suppress-types '((defvaralias) (lexical-binding)))
