emacs/.emacs.d/README.org
** Doom Runtime Optimizations

=Doom Emacs= contains a number of setting configurations to improve runtime
performance. The following was copied from [[https://github.com/doomemacs/doomemacs/blob/da3d0687c5008edbbe5575ac1077798553549a6a/lisp/doom-start.el#L30][doom-start.el]].

*Source:*
+ [[https://github.com/doomemacs/doomemacs/blob/da3d0687c5008edbbe5575ac1077798553549a6a/lisp/doom-start.el#L30][github.com/doomemacs]]
+ [[https://github.com/MArpogaus/emacs.d?tab=readme-ov-file#doom-runtime-optimizations][github.com/MArpogaus]]

#+begin_src emacs-lisp
;; PERF: A second, case-insensitive pass over `auto-mode-alist' is time wasted.
(setq auto-mode-case-fold nil)

;; PERF: Disable bidirectional text scanning for a modest performance boost.
;;   I've set this to `nil' in the past, but the `bidi-display-reordering's
;;   docs say that is an undefined state and suggest this to be just as good:
(setq-default bidi-display-reordering 'left-to-right
              bidi-paragraph-direction 'left-to-right)

;; PERF: Disabling BPA makes redisplay faster, but might produce incorrect
;;   reordering of bidirectional text with embedded parentheses (and other
;;   bracket characters whose 'paired-bracket' Unicode property is non-nil).
(setq bidi-inhibit-bpa t)  ; Emacs 27+ only

;; Reduce rendering/line scan work for Emacs by not rendering cursors or
;; regions in non-focused windows.
(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)

;; More performant rapid scrolling over unfontified regions. May cause brief
;; spells of inaccurate syntax highlighting right after scrolling, which should
;; quickly self-correct.
(setq fast-but-imprecise-scrolling t)

;; Increase how much is read from processes in a single chunk (default is 4kb).
;; This is further increased elsewhere, where needed (like our LSP module).
(setq read-process-output-max (* 64 1024))  ; 64kb

;; Don't ping things that look like domain names.
(setq ffap-machine-p-known 'reject)

;; Emacs "updates" its ui more often than it needs to, so slow it down slightly
(setq idle-update-delay 1.0)  ; default is 0.5

;; Font compacting can be terribly expensive, especially for rendering icon
;; fonts on Windows. Whether disabling it has a notable affect on Linux and Mac
;; hasn't been determined, but do it anyway, just in case. This increases
;; memory usage, however!
(setq inhibit-compacting-font-caches t)

;; Introduced in Emacs HEAD (b2f8c9f), this inhibits fontification while
;; receiving input, which should help a little with scrolling performance.
(setq redisplay-skip-fontification-on-input t)
#+end_src

* Init File
:PROPERTIES:
:header-args: :tangle init.el
:END:

The =init.el= serves as the primary configuration file. Most settings and
configurations are organized in separate 'modules/init-*.el' files and loaded
at the end of this file.

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init.el")>>
#+end_src

** Profile Emacs Startup
:PROPERTIES:
:ID:       1269b427-94e9-4df5-98bf-c83a31db096d
:END:

This custom code computes general startup statistics and returns them in
=*scratch*=. This is possible based on our configuration of =initial-buffer-choice=
and =initial-scratch-message= settings in the [[id:534b1a9a-e956-42b1-bf81-40b4e82b2c8e][Disable UI Elements]] section.

*N.B.* If ~use-pacakge-compute statistics t~ (set in [[id:a4fb8525-6004-4685-b4cc-297699db426e][Setup Use-Package]]), calling
~M-x use-package-report~ opens temporary buffer containing package-specific
initialization times.

#+begin_src emacs-lisp
;; From https://github.com/LionyxML/emacs-kick/blob/master/init.el
(add-hook 'after-init-hook
          (lambda ()
            (with-current-buffer (get-buffer-create "*scratch*")
              (insert (format "*Welcome to Emacs!*

+ Loading time :: %s secs
+ Packages :: %s
+ Garbage Collections :: %s"
                              (emacs-init-time "%.2f")
                              (number-to-string (length package-activated-list))
                              gcs-done)))))
#+end_src

** Package Setup
*** Initialize Package Resources

Here, we setup package management, specify desired package archives, and
prioritize them for efficient package installation/updates.

#+begin_src emacs-lisp
;; Required for managing external packages
(require 'package)

(setopt package-archives
      '(("gnu elpa"  . "https://elpa.gnu.org/packages/")
        ("melpa"     . "https://melpa.org/packages/")
        ("nongnu"    . "https://elpa.nongnu.org/nongnu/"))
      package-archive-priorities
      '(("melpa"    . 6)
        ("gnu elpa" . 5)
        ("nongnu"   . 4)))

;; MANDITORY: Emacs must be aware of available packages before installing
(package-initialize)
#+end_src

*** Setup Use-Package
:PROPERTIES:
:ID:       a4fb8525-6004-4685-b4cc-297699db426e
:END:

=use-package= is an Emacs macro (added in Emacs29) designed to simplify and
optimize the configuration and management of Emacs packages.

It is possible to minimize startup time by selectively loading packages _when
needed_. The macro provides several ways to /defer/ package loading times (~:demand
t~ loads the package immediately):

+ :hook :: Loaded after hook invoked for the first time
+ :bind, :bind-keymap :: Loaded after keybinding used for first time
+ :commands :: Loaded after specified command is used
+ :mode :: Loaded after file with specific extension is opened
+ :after :: Loaded after other specific packages are loaded
+ :defer t :: Defer loading until after startup

If ~use-package-compute-statistics t~, calling ~M-x use-package-report~ will
display whether the package is:

+ Configured :: ~:config~ has been processed (ie. loaded)
+ Initialized :: ~:init~ has been processed (but not loaded)
+ Declared :: Not loaded or initialized

#+begin_src emacs-lisp
;; Ensures backwards compatability; 'use-package' added in Emacs29
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

;; Automatically install package if package not already installed
(require 'use-package-ensure)
(setopt use-package-always-ensure t)

;; Track load times and return loading/installation output messages
(setopt use-package-compute-statistics t
        use-package-verbose t)
#+end_src

*** Set Load-Path For Custom Packages

Custom packages stored in =~/.emacs.d/lisp=.

#+begin_src emacs-lisp
(let ((default-directory (expand-file-name "lisp" user-emacs-directory)))
  (unless (file-directory-p default-directory)
    (make-directory default-directory t))
  (add-to-list 'load-path default-directory)
  (normal-top-level-add-subdirs-to-load-path))
#+end_src

** Tidy Emacs Directory
:PROPERTIES:
:ID:       a0a6ce0f-55d9-415f-a70c-48716e9d8c61
:END:

=no-littering= is an Emacs package designed to organize =.emacs.d= and prevent
clutter from various configuration files and cached data. By default,
configuration and data files in =/etc= and =/var= sub-directories, respectively, of
~user-emacs-directory~. This is advantageous as default paths used to store these
items may not be consistent across Emacs packages.

*N.B.* Emacs stores customization information in =custom.el=. Here, we move that
file to =/etc= and load.

*N.B.* Customizations and data files frequently change. Therefore, we will store
that information in the cloud and not in the repo.

#+begin_src emacs-lisp
(use-package no-littering
  :demand t
  :init
  (setopt no-littering-etc-directory (expand-file-name "no-littering" user-settings-path))
  (setopt no-littering-var-directory (expand-file-name "no-littering" user-settings-path))
  :config
  (setopt custom-file (no-littering-expand-etc-file-name "custom.el"))
  (load custom-file :no-error-if-file-is-missing))
#+end_src

* Emacs
:PROPERTIES:
:header-args: :tangle modules/init-emacs.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-emacs.el")>>
#+end_src

** Frame
*** Frame Size

=default-frame-alist= setting specifies parameters of an Emacs frame. Adding
~'(fullscreen . maximized)~ configures Emacs to automatically open in
full-screen.

#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

*** Frame Title

=frame-title-format= setting specifies the template for displaying the title bar
of visible Emacs frames. Here, we set it to read ~emacs: <file-name>~.

#+begin_src emacs-lisp
(setopt frame-title-format
        '("emacs: "
          (:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name)) "%b"))))
#+end_src

*** Buffer Name

=uniquify-buffer-name-style= setting controls how Emacs handles the naming of
buffers displaying files containing the same name; for example
=~/dir/subdir_1/file.el= and and =~/dir/subdir_2/file.el=.

Setting to ~'forward~ displays the name as a truncated file-path in order to
distinguish between files; resulting in =subdir_1/file.el= and =subdir_2/file.el=.

#+begin_src emacs-lisp
(setopt uniquify-buffer-name-style 'forward)
#+end_src

** Minibuffer

The following recommendations are suggested by the creator of the =vertico.el=
package (see [[https://github.com/minad/vertico][github/vertico]])

*** Recursive Minibuffer
:PROPERTIES:
:ID:       dfe5aad6-6c0b-4e06-8c83-028a59bb9ad1
:END:

=enable-recursive-minibuffers=, when set to ~t~ allows us to enter multiple
minibuffer commands consecutively without closing the previous one. This is
useful when accessing information while already in a minibuffer prompt.

*Example Use-Case:* Checking another file's path in the middle of a ~M-x find-file~
prompt. Possible to call ~M-x~ again, open another minibuffer, check what we
need, and then return to the initial minibuffer.

#+begin_src emacs-lisp
(setopt enable-recursive-minibuffers t)
#+end_src

*** Read-only Minibuffer
:PROPERTIES:
:ID:       bbc9b953-b553-4928-a0ef-daf6df48a1f8
:END:

The minibuffer-prompt is not meant to be edited. Setting
=minibuffer-prompt-properties= to read-only and hooking the built-in
=cursor-intangible-mode= prevents accidental modifications of the prompt text.

#+begin_src emacs-lisp
(setopt minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))

(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
#+end_src

*N.B.* If ~(setopt minibuffer-prompt-properties nil)~ and we call ~M-x~, possible to
modify the "M-x" by moving the cursor back and deleting "M", "-", and/or
"x". _Not ideal_.

