emacs/.emacs.d/init.el

;; From https://github.com/LionyxML/emacs-kick/blob/master/init.el
(add-hook 'after-init-hook
          (lambda ()
            (with-current-buffer (get-buffer-create "*scratch*")
              (insert (format "*Welcome to Emacs!*

+ Loading time :: %s secs
+ Packages :: %s
+ Garbage Collections :: %s"
                              (emacs-init-time "%.2f")
                              (number-to-string (length package-activated-list))
                              gcs-done)))))

;; Required for managing external packages
(require 'package)

(setopt package-archives
      '(("gnu elpa"  . "https://elpa.gnu.org/packages/")
        ("melpa"     . "https://melpa.org/packages/")
        ("nongnu"    . "https://elpa.nongnu.org/nongnu/"))
      package-archive-priorities
      '(("melpa"    . 6)
        ("gnu elpa" . 5)
        ("nongnu"   . 4)))

;; MANDITORY: Emacs must be aware of available packages before installing
(package-initialize)

;; Ensures backwards compatability; 'use-package' added in Emacs29
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

;; Automatically install package if package not already installed
(require 'use-package-ensure)
(setopt use-package-always-ensure t)

;; Track load times and return loading/installation output messages
(setopt use-package-compute-statistics t
        use-package-verbose t)

(let ((default-directory (expand-file-name "lisp" user-emacs-directory)))
  (unless (file-directory-p default-directory)
    (make-directory default-directory t))
  (add-to-list 'load-path default-directory)
  (normal-top-level-add-subdirs-to-load-path))

(use-package no-littering
  :demand t
  :init
  (setopt no-littering-etc-directory (expand-file-name "no-littering" user-settings-path))
  (setopt no-littering-var-directory (expand-file-name "no-littering" user-settings-path))
  :config
  (setopt custom-file (no-littering-expand-etc-file-name "custom.el"))
  (load custom-file :no-error-if-file-is-missing))

  (add-to-list 'load-path (expand-file-name "modules" user-emacs-directory))
