stow/emacs/.emacs.d/modules/init-emacs.el

(add-to-list 'default-frame-alist '(fullscreen . maximized))

(setopt frame-title-format
        '("emacs: "
          (:eval (if (buffer-file-name)
                     (abbreviate-file-name (buffer-file-name)) "%b"))))

(setopt uniquify-buffer-name-style 'forward)

(setopt enable-recursive-minibuffers t)

(setopt minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))

(add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
