emacs/.emacs.d/README.org
*** Make C-g a Bit More Helpful
:PROPERTIES:
:ID:       51c833dd-b403-40e5-8359-f3b6f15193ff
:END:

By default, the function =keyboard-quit= only closes the minibuffer if the cursor
is inside the minibuffer-window. That is annoying. The following adds some
quality-of-life refinement.

*Source:* [[https://protesilaos.com/codelog/2024-11-28-basic-emacs-configuration/#h:1e468b2a-9bee-4571-8454-e3f5462d9321][protesilaos.com/basic-emacs-configuration]]

#+begin_src emacs-lisp
(defun prot/keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.  When a minibuffer is
- open, but not focused, close the minibuffer.  When the
- Completions buffer is selected, close it.  In every other case
- use the regular `keyboard-quit'."

  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))

(define-key global-map (kbd "C-g") #'prot/keyboard-quit-dwim)
#+end_src

*** Custom Minibuffer Functions
**** Jump to Minibuffer

This is just nice to have.

#+begin_src emacs-lisp
(defun my/jump-to-minibuffer ()
  "Switch to minibuffer window (if active)"
  (interactive)
  (when (active-minibuffer-window)
    (select-window (active-minibuffer-window))))
#+end_src

** Cursor
*** Cursor Style

#+begin_src emacs-lisp
(setq-default cursor-type 'bar)
#+end_src

** Mouse/Scrolling
*** Precision Scrolling

=pixel-scroll-precision-mode= is a /built-in/ minor-mode that, when activated,
provides a smoother, more precise scrolling experience. Scrolling occurs by
pixel and not by larger fixed amounts like whole lines or pages.

*N.B.* Recommended by [[https://tony-zorman.com/posts/emacs-potpourri.html][tony-zorman.com]]

#+begin_src emacs-lisp
(pixel-scroll-precision-mode 1)
#+end_src

*** Mouse Behavior

+ mouse-yank-at-point :: ~t~ to paste at cursor, not where mouse is pointing
+ mouse-wheel-follow-mouse :: ~'t~ to scroll buffer under mouse
+ mouse-wheel-progressive-speed :: ~nil~ to disable accelerated scrolling

#+begin_src emacs-lisp
(setopt mouse-yank-at-point t
        mouse-wheel-follow-mouth 't
        mouse-wheel-progressive-speed nil)
#+end_src

** Line Numbers
*** Display Line Numbers in Fringe
:PROPERTIES:
:ID:       253507fc-cbf8-40a5-a490-c8651a7d44dd
:END:

=display-line-numbers= is an Emacs package providing =display-line-numbers-mode=
that, when activated, displays the line number on the left side of the buffer.

By default, the fringe is not a fix amount so code on line ~1_000~ will appear
slightly indented from code on line ~1~. To prevent this,
=display-line-numbers-width= is set to ~4~ as we do not anticipate working on files
longer than ~9_999~ lines.

*N.B.* See =global-display-line-numbers-mode=

#+begin_src emacs-lisp
(use-package display-line-numbers
  :defer t
  :hook ((prog-mode conf-mode text-mode)
         (org-mode . (lambda () (display-line-numbers-mode 0))))
  :custom
  (display-line-numbers-width  4 "Prevent uneven gutter due to length of linum"))
#+end_src

** Buffers
*** Buffer Column Width
:PROPERTIES:
:ID:       6881fadb-9439-4939-974c-e50265bd8a0a
:END:
:RELATED:
+ [[id:c955493b-ad4d-4661-ba0a-ad79ce52dbc4][Cleanup White Spaces]] :: See =whitespace-line-column=
:END:

=fill-column= setting specifies the maximum width (ie number of columns) of the
buffer before text is wrapped, or filled, to the next line. Setting to ~79~ to
comply with =PEP8= style guide.

#+begin_src emacs-lisp
(setopt fill-column 79)
#+end_src

*** Visual Line Wrapping

=global-visual-line-mode= is a /built-in/ minor-mode that, when activated, enables
visual line wrapping across all buffers. Lines that exceed the width of the
frame are automatically wrapped.

#+begin_src emacs-lisp
(global-visual-line-mode 1)

;; Break at whitespace, not middle of word
(setopt word-wrap t)
#+end_src

*** Overwrite Active Region

=delete-selection-mode= is a /built-in/ minor-mode that, when activated, replaces
or overwrites the selected region. This behavior is similar to most text
editors. Deactivated by default, Emacs will paste/enter text _after_ the selected
region. *Annoying*.

#+begin_src emacs-lisp
;; Replace active region when typing text
(delete-selection-mode 1)
#+end_src

*** Automatic Buffer Reloading

=global-auto-revert-mode= is a /built-in/ minor-mode that, when
activated,automatically reloads buffers when the underlying file changes on
disk. This is particularly useful when open files change should we switch =git=
branches.

#+begin_src emacs-lisp
(global-auto-revert-mode 1)
#+end_src

*** Custom Buffer Functions
:PROPERTIES:
:ID:       453fdeac-b2bb-4217-9803-d5c89ceaf6de
:END:
:RELATED:
+ [[id:d831e4e4-e9b1-480e-aa1a-a152d9707275][General.el]]
:END:

**** Copy Buffer Name

#+begin_src emacs-lisp
(defun my/kill-buffer-name ()
  "Copy file-name of current buffer"
  (interactive)
  (kill-new (buffer-name)))
#+end_src

**** Copy Relative Buffer Path

#+begin_src emacs-lisp
(defun my/kill-relative-buffer-path ()
  "Copy relative buffer path to kill ring.

Replace '/home/<username>' prefix with '~' if applicable."
  (interactive)
  (if-let* ((full-path (buffer-file-name))
            (abbrev-path (abbreviate-file-name full-path)))
      (progn
        (kill-new abbrev-path)
        (message "Buffer path copied to kill ring: %s" full-path))
    (message "Buffer is not visiting a file.")))
#+end_src

**** Kill Buffers Except Scratch

*N.B.* ~M-x crux-kill-other-buffers~ to kill all but current buffer

#+begin_src emacs-lisp
(defun my/kill-buffers-except (buffer-name)
  "Kill all buffers except for BUFFER-NAME."
  (dolist (buffer (buffer-list))
    (unless (or (string-equal (buffer-name buffer) buffer-name)
                (string-equal (buffer-name buffer) (concat " " buffer-name)))
      (kill-buffer buffer))))
#+end_src

#+begin_src emacs-lisp
(defun my/kill-all-buffers-except-scratch ()
  "Kill all buffers except for *scratch*."
  (interactive)
  (my/kill-buffers-except "*scratch*"))
#+end_src

**** Kill Buffers Given Mode

#+begin_src emacs-lisp
(defun my/kill-buffers-by-mode (&rest modes)
  "Kill all buffers derived from any of MODES.

Ex: (my/kill-buffers-by-mode 'help-mode 'helpful-mode)"
  (let ((killed 0))
    (mapc (lambda (buffer)
            (with-current-buffer buffer
              (when (apply #'derived-mode-p modes)
                (kill-buffer buffer)
                (setq killed (1+ killed)))))
          (buffer-list))
    (message "Killed %d buffer(s) derived from %s" killed modes)))
#+end_src

** White Space
*** Indicate Empty Lines

=indicate-empty-lines= setting, when set to ~t~, highlights empty lines in the
buffer. Later, we will configure the automatic removal of empty lines.

#+begin_src emacs-lisp
(setopt indicate-empty-lines t)
#+end_src

*** Cleanup White Spaces
:PROPERTIES:
:ID:       c955493b-ad4d-4661-ba0a-ad79ce52dbc4
:END:

=whitespace= is a /built-int/ Emacs package providing =whitespace-mode= that, when
activated, highlights white-spaces in buffers; the package also includes
=whitespace-cleanup-mode= which automatically removes white-spaces.

*N.B.* [[https://www.emacswiki.org/emacs/WhiteSpace][Emacswiki]] provides a nice overview of the settings.

=whitespace-style= setting specifies /which/ white-spaces are visualized:
  + face :: Visualize spaces by changing =face= color (instead of in table)
  + trailing :: Flag trailing white-space
  + lines-tail :: Columns beyond ~whitespace-line-column~ are
    highlighted via faces (must exclude =lines= in our configuration).
  + empty :: Flag empty lines (only at beginning/end of buffer)
  + indentation::space :: Flag ~TABs~ at beginning of lines
  + space-before-tab::tab :: Flag extra ~SPC~ before ~TAB~

*N.B.* =fill-column= previously set in [[id:6881fadb-9439-4939-974c-e50265bd8a0a][Buffer Column Width]] section.

#+begin_src emacs-lisp
(use-package whitespace
  :hook ((prog-mode . whitespace-mode)
         (before-save . whitespace-cleanup)
         ;; Disable in 'org'; always flags long org-links
         (org-mode . (lambda () (whitespace-mode 0)))
         ;; Makefiles rely heavily on indentation and whitespace
         (makefile-mode . (lambda ()
                            (setq indent-tabs-mode t
                                  whitespace-mode nil)
                            (add-hook 'before-save-hook
                                      #'delete-trailing-whitespace))))
  :custom
  (whitespace-line-column fill-column "Highlight text beyond column")
  (whitespace-style '(face
                      trailing
                      lines-tail
                      empty
                      indentation::space
                      space-before-tab::tab))
  :config
  (global-whitespace-mode 0))
#+end_src

** Indentation
*** Indentation Width

=tab-width= setting specifies the number of spaces a single ~TAB~
represents. Alternatively, =standard-indent= setting sets the number of spaces
for Emacs commands that do not have a specific indentation width set. For
consistency, we define and set both variables to =my-indent-width=.

#+begin_src emacs-lisp
(setq my-indent-width 4)
(setq-default tab-width my-indent-width
              standard-indent my-indent-width)
#+end_src

*** Tab Behavior
:PROPERTIES:
:ID:       925b16ea-4f78-49ca-93db-0012b84ca33f
:END:

=tab-always-indent= setting specifies the behavior of ~TAB~. This is particularly
relevant in programming modes. Setting to ~'complete~ results in ~TAB~ first
attempting to indent the line (if the line is already properly indented);
otherwise ~TAB~ will trigger code completion instead (if available).

#+begin_src emacs-lisp
(setq-default tab-always-indent 'complete)
#+end_src

*** Indent Using Spaces

=indent-tabs-mode= is a /built-in/ minor-mode that, when activated, specifies that
indentation _can_ insert ~\t~ characters. Setting to ~nil~ deactivate the mode, thus
~\s~ is used; as recommended in the =PEP8= style guide, removing discrepancies that
may occur between different text editors or IDEs.

#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
#+end_src

** History
*** Window Layout History

=winner-mode= is a /built-in/ minor-mode that, when activated, tracks changes to
window layouts (ie splits, closing, resizing, etc). Changes are stored in
=winner-ring-alist=. The mode includes two functions for undoing and redoing
changes to the window:

+ winner-undo :: Default ~C-c <left>~ to revert window layout
+ winner-redo :: Default ~C-c <right>~ to redo the previously undone change

#+begin_src emacs-lisp
(winner-mode 1)
#+end_src

*** Minibuffer History
:PROPERTIES:
:ID:       e010f1a6-c723-4ca1-bf39-62b3a9672797
:END:

=savehist-mode= is a /built-in/ minor-mode that, when activated, saves the
minibuffer history (ie commands, file-names, search history, etc) across Emacs
sessions. Minibuffer history saved in =savehist.el= (see =savehist-file= variable),
whose location is modified by the =no-litter= package (see [[id:a0a6ce0f-55d9-415f-a70c-48716e9d8c61][Tidy Emacs Directory]]).

*N.B.* Recommended by the creator of the =vertico.el= ([[https://github.com/minad/vertico][github/vertico]]).

#+begin_src emacs-lisp
(savehist-mode 1)
#+end_src

