stow/emacs/.emacs.d/modules/init-emacs.el

(defun prot/keyboard-quit-dwim ()
  "Do-What-I-Mean behaviour for a general `keyboard-quit'.

The generic `keyboard-quit' does not do the expected thing when
the minibuffer is open.  Whereas we want it to close the
minibuffer, even without explicitly focusing it.

The DWIM behaviour of this command is as follows:

- When the region is active, disable it.  When a minibuffer is
- open, but not focused, close the minibuffer.  When the
- Completions buffer is selected, close it.  In every other case
- use the regular `keyboard-quit'."

  (interactive)
  (cond
   ((region-active-p)
    (keyboard-quit))
   ((derived-mode-p 'completion-list-mode)
    (delete-completion-window))
   ((> (minibuffer-depth) 0)
    (abort-recursive-edit))
   (t
    (keyboard-quit))))

(define-key global-map (kbd "C-g") #'prot/keyboard-quit-dwim)

(defun my/jump-to-minibuffer ()
  "Switch to minibuffer window (if active)"
  (interactive)
  (when (active-minibuffer-window)
    (select-window (active-minibuffer-window))))

(setq-default cursor-type 'bar)

(pixel-scroll-precision-mode 1)

(setopt mouse-yank-at-point t
        mouse-wheel-follow-mouth 't
        mouse-wheel-progressive-speed nil)

(use-package display-line-numbers
  :defer t
  :hook ((prog-mode conf-mode text-mode)
         (org-mode . (lambda () (display-line-numbers-mode 0))))
  :custom
  (display-line-numbers-width  4 "Prevent uneven gutter due to length of linum"))

(setopt fill-column 79)

(global-visual-line-mode 1)

;; Break at whitespace, not middle of word
(setopt word-wrap t)

;; Replace active region when typing text
(delete-selection-mode 1)

(global-auto-revert-mode 1)

(defun my/kill-buffer-name ()
  "Copy file-name of current buffer"
  (interactive)
  (kill-new (buffer-name)))

(defun my/kill-relative-buffer-path ()
  "Copy relative buffer path to kill ring.

Replace '/home/<username>' prefix with '~' if applicable."
  (interactive)
  (if-let* ((full-path (buffer-file-name))
            (abbrev-path (abbreviate-file-name full-path)))
      (progn
        (kill-new abbrev-path)
        (message "Buffer path copied to kill ring: %s" full-path))
    (message "Buffer is not visiting a file.")))

(defun my/kill-buffers-except (buffer-name)
  "Kill all buffers except for BUFFER-NAME."
  (dolist (buffer (buffer-list))
    (unless (or (string-equal (buffer-name buffer) buffer-name)
                (string-equal (buffer-name buffer) (concat " " buffer-name)))
      (kill-buffer buffer))))

(defun my/kill-all-buffers-except-scratch ()
  "Kill all buffers except for *scratch*."
  (interactive)
  (my/kill-buffers-except "*scratch*"))

(defun my/kill-buffers-by-mode (&rest modes)
  "Kill all buffers derived from any of MODES.

Ex: (my/kill-buffers-by-mode 'help-mode 'helpful-mode)"
  (let ((killed 0))
    (mapc (lambda (buffer)
            (with-current-buffer buffer
              (when (apply #'derived-mode-p modes)
                (kill-buffer buffer)
                (setq killed (1+ killed)))))
          (buffer-list))
    (message "Killed %d buffer(s) derived from %s" killed modes)))

(setopt indicate-empty-lines t)

(use-package whitespace
  :hook ((prog-mode . whitespace-mode)
         (before-save . whitespace-cleanup)
         ;; Disable in 'org'; always flags long org-links
         (org-mode . (lambda () (whitespace-mode 0)))
         ;; Makefiles rely heavily on indentation and whitespace
         (makefile-mode . (lambda ()
                            (setq indent-tabs-mode t
                                  whitespace-mode nil)
                            (add-hook 'before-save-hook
                                      #'delete-trailing-whitespace))))
  :custom
  (whitespace-line-column fill-column "Highlight text beyond column")
  (whitespace-style '(face
                      trailing
                      lines-tail
                      empty
                      indentation::space
                      space-before-tab::tab))
  :config
  (global-whitespace-mode 0))

(setq my-indent-width 4)
(setq-default tab-width my-indent-width
              standard-indent my-indent-width)

(setq-default tab-always-indent 'complete)

(setq-default indent-tabs-mode nil)

(winner-mode 1)

(savehist-mode 1)
