emacs/.emacs.d/README.org
*** Cursor Position History

=saveplace-mode= is a /built-in/ minor-mode that, when activated, saves the cursor
position in a given file; if previously visited, the cursor will move to the
last known position. Cursor positions saved in =save-place.el= (see
=save-place-file= variable), whose location is modified by the =no-litter= package
(see [[id:a0a6ce0f-55d9-415f-a70c-48716e9d8c61][Tidy Emacs Directory]]).

*N.B.* Suggested in [[https://www.jamescherti.com/essential-emacs-packages/][jamescherti.com]] blog-post.

#+begin_src emacs-lisp
(save-place-mode 1)
#+end_src

** Prompting
*** Lazy Prompt Response

=use-short-answers= setting, when set to ~t~, allows users to respond to
confirmation prompts with simple ~y~ or ~n~ (instead of typing the full words).

The functions =yes-or-no-p= and =y-or-n-p= are effectively the same, however the
former requires full ~yes~ or ~no~ answers. Here, we effectively replace the
function with =y-or-no-p= so that single letter answers may be used across all
prompts.

*N.B.* Suggested in [[https://www.masteringemacs.org/article/disabling-prompts-emacs][masteringemacs.org]] article.

#+begin_src emacs-lisp
(setopt use-short-answers t)
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

*** Disable New File Confirmation

=confirm-nonexistent-file-or-buffer= setting, when set to ~nil~, disables user
confirmation before visiting a new file or buffer.

*N.B.* Suggested in [[https://www.masteringemacs.org/article/disabling-prompts-emacs][masteringemacs.org]] article.

#+begin_src emacs-lisp
(setopt confirm-nonexistent-file-or-buffer nil)
#+end_src

*** CRM Prompt Indicator

The custom function ~crm-indicator~ adds an indicator to the completion prompt
when using ~completing-read-multiple~. This makes it easier to visualize multiple
inputs.

*N.B.* Suggested by the creator of the =vertico.el= package ([[https://github.com/minad/vertico][github/vertico]]).

#+begin_src emacs-lisp
(defun my/crm-indicator (args)
  "Add indicator to completion promp when using 'completing-read-multiple'"
  (cons (format "[CRM%s] %s"
                (replace-regexp-in-string
                 "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                 crm-separator)
                (car args))
        (cdr args)))

(advice-add #'completing-read-multiple :filter-args #'my/crm-indicator)
#+end_src

For example, calling the example function ~test-crm-indicator~ indicates that
selecting multiple options is both possible using a comma-separator.

*N.B.* src-block not tangled to configuration file.

#+begin_src emacs-lisp :tangle no
(defun test-crm-indicator ()
  "A custom function using completing-read-multiple."
  (interactive)
  (let ((choices '("Option A" "Option B" "Option C")))
    (completing-read-multiple "Choose options: " choices)))
#+end_src

*** Killing Buffer with Live Process

The following sidesteps the prompt that asks you if you want to kill a buffer
with a live process attached to it.

*N.B.* Suggested in [[https://www.masteringemacs.org/article/disabling-prompts-emacs][masteringemacs.org]] article.

#+begin_src emacs-lisp
(setopt kill-buffer-query-functions
        (remq 'process-kill-buffer-query-function
              kill-buffer-query-functions))
#+end_src

** Highlighting
:PROPERTIES:
:ID:       1ae14e20-459c-44ec-8c2a-b5f2f64116ac
:END:
:RELATED:
+ [[id:5e72d5f0-fdaf-491a-9a84-9806ee295d0a][Highlight TODOs]]
:END:

*** Cursor When Switching Buffers

=beacon= is an Emacs package providing =beacon-mode= minor-mode that, when
activated, highlights (flashes) the line containing the cursor when changing
current buffers.

#+begin_src emacs-lisp
(use-package beacon
  :defer t
  :hook (after-init . beacon-mode))
#+end_src

*** Matching Delimiter Pairs

=paren= is a /built-in/ Emacs package providing =show-paren-mode= that, when
activated, highlights matching pairs of parentheses/delimiters when the cursor
is positioned at a delimiter. Several settings should be mentioned:

+ show-paren-style :: ~'parenthesis~ to only highlight delimiter
  - ~'expression~ highlights the entire enclosed text
+ show-paren-context-when-offscreen :: ~'overlay~
  - Overlay popup provides additional context if matching pair off screen

*N.B.* The /built-in/ minor-mode =electric-pair-mode= is also activated, which
automatically inserts a closing delimiter.

#+begin_src emacs-lisp
(use-package paren
  :defer t
  :custom
  (show-paren-style 'parenthesis "Only highlight ()")
  (show-paren-when-point-inside-paren t)
  (show-paren-when-point-in-periphery t)
  ;; If cursor on ), show overlay for (
  (show-paren-context-when-offscreen 'overlay)
  :config
  (show-paren-mode 1))

(use-package elec-pair
  :defer t
  :config (electric-pair-mode 1)
  :custom
  ;; Prevent closing pair if POINT at beginning or middle of word
  (electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit))
#+end_src

*** Symbols/Things at Point

=highlight-thing= is an Emacs package providing =highlight-thing-mode= that, when
activated, automatically highlights all visible occurrences of the symbol/thing
at point.

#+begin_src emacs-lisp
(use-package highlight-thing
  :hook ((prog-mode . highlight-thing-mode)
         (org-mode . highlight-thing-mode))
  :custom
  (highlight-thing-exclude-thing-under-point t)
  (highlight-thing-case-sensitive-p t)
  (highlight-thing-ignore-list
   '("False" "True", "return", "None", "if", "else", "self",
     "import", "from", "in", "def", "class")))
#+end_src

*** Line at Point

=global-hl-line-mode= is a /built-in/ minor-mode that, when activated, highlights
the current line (see related =hl-line-mode=).

#+begin_src emacs-lisp
(global-hl-line-mode 1)
#+end_src

*** Pulse Killed Region

The custom function, copied from [[https://www.youtube.com/watch?v=oQ9JE9kRwG8][youtube/gopar]], highlights (pulses) the current
region and is executed before =kill-ring-save=, making it easier to visualize
what text/region is being copied.

#+begin_src emacs-lisp
(defun gopar/pulse-current-region (&rest _)
  "Pulse the current implicit or active region"
  (if mark-active
      (pulse-momentary-highlight-region (region-beginning) (region-end))
    (pulse-momentary-highlight-region (mark) (point))))

(advice-add #'kill-ring-save :before #'gopar/pulse-current-region)
#+end_src

** Files + Encoding
*** Automatically Revert Buffer

=global-auto-revert-mode= is a /built-in/ minor-mode that, when activated,
automatically refreshes the contents of buffers after the visited file changes
on disk. This ensures buffers are automatically updated after changing =git=
branches.

#+begin_src emacs-lisp
(global-auto-revert-mode)
#+end_src

*** Encoding

[[https://blog.hubspot.com/website/what-is-utf-8][UTF-8]] is central to the storage and encoding of text and files. Although other
encoding systems exist, =utf-8= is practically a standard, at least in the West,
and so it is important that we instruct Emacs to treat files as UTF-8 by
default. For more information, read [[https://www.masteringemacs.org/article/working-coding-systems-unicode-emacs][MasteringEmacs]].

#+begin_src emacs-lisp
;; https://www.masteringemacs.org/article/working-coding-systems-unicode-emacs
(set-default-coding-systems 'utf-8)

;; https://github.com/Thaodan/emacs.d
(define-coding-system-alias 'UTF-8 'utf-8)
#+end_src

** Boookmarks

=bookmark= is a /built-in/ Emacs package providing users the ability to efficiently
store and access specific locations in frequently visited files. Bookmarks are
saved in =bookmarks-default.el= (see =bookmark-file= variable), whose location is
modified by the =no-litter= package (see [[id:a0a6ce0f-55d9-415f-a70c-48716e9d8c61][Tidy Emacs Directory]]).

Frequently used functions include:

+ bookmark-set :: ~C-x r m~; Set bookmark at current location
  - Prompt user for desired name of bookmark
  - Bookmarked locations indicated by flag in fringe of buffer
  - Bookmark details stored in =bookmark-alist=

+ bookmark-jump :: ~C-x r b~; Select bookmark and jump to location

+ bookmark-save :: Export =bookmark-alist= to specified file

+ bookmark-delete :: Delete bookmark in =bookmark-alist=

+ bookmark-bmenu-list :: Open buffer containing all bookmarks

*N.B.* Related, the =register= package is a temporary alternative where locations
are assigned to a single character (and do not persist in memory). Something to
explore in the future.

#+begin_src emacs-lisp
(use-package bookmark
  :custom
  (bookmark-save-flag t "Save bookmarks when Emacs killed")
  (bookmark-fringe-mark t "Non-nil to show icon in fringe"))
#+end_src

** Images
:PROPERTIES:
:ID:       0bdd31cb-56e6-4709-8294-a6c701dad660
:END:
:RELATED:
+ [[id:c934464b-8b3c-4203-ac56-d916e21d470c][Images in Org]]
:END:

*** Automatically Display Image Files

=auto-image-file-mode= is a /built-in/ minor-mode that, when activated,
automatically displays image files when opened.

#+begin_src emacs-lisp
(auto-image-file-mode 1)
#+end_src

** Ediff

=ediff-split-window-function= setting controls how Emacs splits the window when
displaying two files or buffers in =ediff=. Setting to ~'split-window-horizontally~
ensures that the buffers are side by side from each other.

=ediff-window-setup-function= setting controls how =ediff= mananges the window
layout in Emacs. Setting to ~'ediff-setup-windows-plain~ ensures that both =ediff=
windows are open in the current Emacs frame.

#+begin_src emacs-lisp
(setopt ediff-split-window-function 'split-window-horizontally
        ediff-window-setup-function 'ediff-setup-windows-plain)
#+end_src

** Custom Functions
:PROPERTIES:
:ID:       8f4885df-ad58-432b-a6cd-1f4524bfc868
:END:
:RELATED:
+ [[id:d831e4e4-e9b1-480e-aa1a-a152d9707275][General.el]]
:END:

*** Jump to Configuration README.org

See ~M-x crux-find-user-init-file~ to open =init.el=.

#+begin_src emacs-lisp
(defun my/find-config-file ()
  "Open 'README.org' in other window."
  (interactive)
  (find-file-other-window (concat user-emacs-directory "README.org")))
#+end_src

*** Evaluate init.el

#+begin_src emacs-lisp
(defun my/eval-init ()
  "To quickly reload the 'init.el' file."
  (interactive)
  (load-file user-init-file))
#+end_src

*** TODO Storing Screenshots For Notes
:PROPERTIES:
:header-args: :tangle no
:END:
Here, we create the sub-directory =figures= in ~my-persist-dir~. This is where we
will store all screenshots for our notes.

#+begin_src emacs-lisp
(defconst my-persist-fig-dir (expand-file-name "figures/" my-persist-dir))
(defconst my-screenshot-dir "~/Pictures/Screenshots")

(unless (file-directory-p my-persist-fig-dir)
  (make-directory figures-dir t)
  (message "Created directory: %s" my-persist-fig-dir))
#+end_src

#+begin_src emacs-lisp
(defun jh--screenshot-latest-file ()
  "Return the path of the latest screenshot in 'my-screenshot-dir'."
  (car (last (directory-files my-screenshot-dir t "[^.].*"))))

(defun jh--screenshot-dest-file-path (base-name extension)
  "Generate full destination file path using BASE-NAME and EXTENSION in
'my-persist-fig-dir'."
  (let ((sanitized (replace-regexp-in-string "[ -]" "_" base-name)))
    (expand-file-name (format "%s.%s" sanitized extension) my-persist-fig-dir)))

(defun jh--screenshot-move-to-dest ()
  "Move the latest screenshot to 'my-persist-fig-dir', prompting for a new
base name.

Returns the full path to the new file."
  (let* ((src (jh--screenshot-latest-file))
         (ext (file-name-extension src))
         (base (read-string "Name of screenshot file (exclude file-format): "))
         (dest (jh--screenshot-dest-file-path base ext)))
    (rename-file src dest)
    dest))

(defun jh--screenshot-insert-org-link (filepath caption)
  "Insert an Org-mode link for FILEPATH with CAPTION."
  (let* ((relative
          (file-relative-name filepath (file-name-directory (buffer-file-name))))
         (name (file-name-base filepath)))
    (insert (format "#+CAPTION: %s\n#+NAME: %s\n[[file:%s]]\n"
                    caption name relative))))

(defun jh/screenshot-copy-to-persist-fig-dir ()
  "Copy the latest screenshot to 'my-persist-fig-dir' with a new name."
  (interactive)
  (let ((dest-file (jh--screenshot-move-to-dest)))
    (message "Screenshot moved to: %s" dest-file)))

(defun jh/screenshot-select-and-insert-org-link ()
  "Insert an Org-mode inline image with caption from an image file in
'my-persist-fig-dir'."
  (interactive)
  (let* ((image-file (read-file-name "Select image: " my-persist-fig-dir))
         (caption (read-string "Enter caption: ")))
    (jh--screenshot-insert-org-link image-file caption)))

(defun jh/screenshot-copy-and-insert-latest ()
  "Copy the latest screenshot and insert an Org-mode image link with caption."
  (interactive)
  (let* ((dest-file (jh--screenshot-move-to-dest))
         (caption (read-string "Enter caption: ")))
    (jh--screenshot-insert-org-link dest-file caption)
    (message "Screenshot moved and link inserted: %s" dest-file)))
#+end_src

** Provide init-emacs.el

#+begin_src emacs-lisp
(provide 'init-emacs)
;;; init-emacs.el ends here
#+end_src

* UI
:PROPERTIES:
:header-args: :tangle modules/init-ui.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-ui.el")>>
#+end_src

** Themes
