stow/emacs/.emacs.d/modules/init-emacs.el

(save-place-mode 1)

(setopt use-short-answers t)
(fset 'yes-or-no-p 'y-or-n-p)

(setopt confirm-nonexistent-file-or-buffer nil)

(defun my/crm-indicator (args)
  "Add indicator to completion promp when using 'completing-read-multiple'"
  (cons (format "[CRM%s] %s"
                (replace-regexp-in-string
                 "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                 crm-separator)
                (car args))
        (cdr args)))

(advice-add #'completing-read-multiple :filter-args #'my/crm-indicator)

(setopt kill-buffer-query-functions
        (remq 'process-kill-buffer-query-function
              kill-buffer-query-functions))

(use-package beacon
  :defer t
  :hook (after-init . beacon-mode))

(use-package paren
  :defer t
  :custom
  (show-paren-style 'parenthesis "Only highlight ()")
  (show-paren-when-point-inside-paren t)
  (show-paren-when-point-in-periphery t)
  ;; If cursor on ), show overlay for (
  (show-paren-context-when-offscreen 'overlay)
  :config
  (show-paren-mode 1))

(use-package elec-pair
  :defer t
  :config (electric-pair-mode 1)
  :custom
  ;; Prevent closing pair if POINT at beginning or middle of word
  (electric-pair-inhibit-predicate 'electric-pair-conservative-inhibit))

(use-package highlight-thing
  :hook ((prog-mode . highlight-thing-mode)
         (org-mode . highlight-thing-mode))
  :custom
  (highlight-thing-exclude-thing-under-point t)
  (highlight-thing-case-sensitive-p t)
  (highlight-thing-ignore-list
   '("False" "True", "return", "None", "if", "else", "self",
     "import", "from", "in", "def", "class")))

(global-hl-line-mode 1)

(defun gopar/pulse-current-region (&rest _)
  "Pulse the current implicit or active region"
  (if mark-active
      (pulse-momentary-highlight-region (region-beginning) (region-end))
    (pulse-momentary-highlight-region (mark) (point))))

(advice-add #'kill-ring-save :before #'gopar/pulse-current-region)

(global-auto-revert-mode)

;; https://www.masteringemacs.org/article/working-coding-systems-unicode-emacs
(set-default-coding-systems 'utf-8)

;; https://github.com/Thaodan/emacs.d
(define-coding-system-alias 'UTF-8 'utf-8)

(use-package bookmark
  :custom
  (bookmark-save-flag t "Save bookmarks when Emacs killed")
  (bookmark-fringe-mark t "Non-nil to show icon in fringe"))

(auto-image-file-mode 1)

(setopt ediff-split-window-function 'split-window-horizontally
        ediff-window-setup-function 'ediff-setup-windows-plain)

(defun my/find-config-file ()
  "Open 'README.org' in other window."
  (interactive)
  (find-file-other-window (concat user-emacs-directory "README.org")))

(defun my/eval-init ()
  "To quickly reload the 'init.el' file."
  (interactive)
  (load-file user-init-file))

(provide 'init-emacs)
;;; init-emacs.el ends here
