emacs/.emacs.d/README.org
*** Load Theme Advice

Emacs themes specify the colors of various ~custom-set-faces~. When switching
between themes, some parts of the old theme remain if the new theme does not
specify the same faces. It is possible to avoid this issue by disabling the
current theme before switching.

#+begin_src emacs-lisp
;; From https://www.unwoundstack.com/blog/switching-emacs-themes.html
(define-advice load-theme (:before (&rest _args) theme-dont-propagate)
  (mapc #'disable-theme custom-enabled-themes))
#+end_src

*** Doom Themes
:PROPERTIES:
:ID:       671dbaef-69f8-4ea6-870f-a72ebf5e13d7
:END:

=doom-themes= is an Emacs package containing a number of Emacs themes.

#+begin_src emacs-lisp
;; Effectively copied from https://github.com/doomemacs/themes
(use-package doom-themes
  :demand t
  :config
  (setopt doom-themes-enable-bold t
          doom-themes-enable-italic t)
  (doom-themes-visual-bell-config)
  (doom-themes-org-config))
#+end_src

*** Custom Theme Functions

These functions make it easier to switch between light- and dark-themes.

#+begin_src emacs-lisp
(defun light ()
  (interactive)
  (load-theme 'doom-tomorrow-day t))

(defun dark ()
  (interactive)
  (load-theme 'doom-one t))
#+end_src

*** Set Default Theme

Below we defined the theme available at startup.

#+begin_src emacs-lisp
(dark)
#+end_src

** Fonts
:PROPERTIES:
   :ID:       a33827ca-f51c-4ad3-90e3-2b2d894c3d48
   :END:

*** TODO Font Style

In Emacs, fonts can be customized to improve readability and visually organize
different content types such as code, prose, or user interfaces. Three common
font types include:

+ default :: Primary font used if no other specifications are provided
+ fixed-pitch :: Mono-spaced (fixed-width) text typically used in programming
+ variable-pitch :: Proportional fonts often used in =org-mode=

This configuration uses the =Jetbrains Mono= font, which is manually downloaded
from [[https://www.jetbrains.com/lp/mono/][jetbrains.com]]. The font was installed by following the [[https://www.jetbrains.com/lp/mono/#how-to-install][how-to]] instructions
verbatim.

#+begin_src emacs-lisp :tangle no
;; https://github.com/daviwil/dotfiles/blob/guix-home/.emacs.d/modules/dw-core.el#L124
(set-face-attribute 'default nil
                    :font "JetBrains Mono"
                    :height 100
                    :weight 'medium)

(set-face-attribute 'fixed-pitch nil
                    :font "JetBrains Mono"
                    :height 100
                    :weight 'medium)

(set-face-attribute 'variable-pitch nil
                    :font "JetBrains Mono"
                    :height 100
                    :weight 'medium)
#+end_src

*** Font Size

In Emacs, the face attribute ~:height~ is a measurement in units of ~0.1~ of a
point. For example, setting the height to ~120~ means a 12-point =font-size=. The
custom function =set-font-size= enables the user to change the font w.r.t. the
more common =font-size=.

#+begin_src emacs-lisp
;; Modified from https://stackoverflow.com/a/50052751
(defun fonts (fontsize)
  "Set the font-pt size."
  (interactive "nFont size: ")
  (let* ((font-height (* 10 fontsize)))
    (set-face-attribute 'default nil :height font-height)
    (set-face-attribute 'fixed-pitch nil :height font-height)
    (set-face-attribute 'variable-pitch nil :height font-height)))

;; Font size at startup
(fonts 16)
#+end_src

** Icons

=nerd-icons= is an Emacs package that provides icons for use in Emacs
buffers. The use of icons improve readability, for example in the minibuffer
icons are displayed next to the file name indicating whether the file is an
=org=, =python=, or =elisp= file.

#+begin_src emacs-lisp
(use-package nerd-icons
  :config
  ;; Download nerd-icons if directory not found
  (unless (car (file-expand-wildcards
                (concat user-emacs-directory "elpa/nerd-icons-*")))
    (nerd-icons-install-fonts t)))

;; Icons inside mini-buffer
(use-package nerd-icons-completion
  :after (marginalia nerd-icons)
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

;; Icons inside 'dired' buffers
(use-package nerd-icons-dired
  :after (dired nerd-icons)
  :hook
  (dired-mode . nerd-icons-dired-mode))
#+end_src

** Modeline
*** Mood-line

=doom-modeline= is the most feature-rich mode-line package for Emacs. For some
reason the right end of the mode-line would be cut off so I could not see the
repo name. Instead, defer to =mood-line=, the lightweight alternative to
=doom-modeline=.

#+begin_src emacs-lisp
;; (use-package doom-modeline
;;   :config (doom-modeline-mode 1)
;;   :custom
;;   ;; Display project_name/../file_name
;;   (doom-modeline-buffer-file-name-style 'truncate-with-project)
;;   (doom-modeline-buffer-encoding nil "Dont care about UTF-8 badge")
;;   (doom-modeline-vcs-max-length 30   "Limit branch name length")
;;   (doom-modeline-enable-word-count t "Turn on wordcount"))

(use-package mood-line
  :hook (after-init . mood-line-mode)
  :custom
  (mood-line-glyph-alist mood-line-glyphs-fira-code)
  (mood-line-format
   (mood-line-defformat
    :left
    (((mood-line-segment-modal)                  . " ")
     ((or (mood-line-segment-buffer-status) " ") . " ")
     ((mood-line-segment-project) . "/")
     ((mood-line-segment-buffer-name)            . "\t\t")
     ((mood-line-segment-cursor-position)        . " | ")
     ((mood-line-segment-scroll)                 . "\t\t")
     ((mood-line-segment-anzu)                   . "  "))
    :right
    (((mood-line-segment-major-mode) . "  ")
     ((mood-line-segment-vc)         . "  ")
     ((mood-line-segment-misc-info)  . "  ")
     ((mood-line-segment-checker)    . "  ")
     ((mood-line-segment-process)    . "  ")))))
#+end_src

*** Display Column Numbers

#+begin_src emacs-lisp
(column-number-mode t)
#+end_src

*** Display Line Numbers

#+begin_src emacs-lisp
(line-number-mode t)
#+end_src

*** Display Search Matches

=anzu= is an Emacs package providing =anzu-mode= that, when activated, displays the
total number of =isearch= matches (and current match position) in the mode-line.

#+begin_src emacs-lisp
(use-package anzu
  :defer t
  :hook (emacs-startup . global-anzu-mode)
  :custom
  (anzu-search-threshold 1000 "Limit n words searched to reduce lag")
  (anzu-replace-threshold 50 "Limit n replacement overlay to reduce lag")
  (anzu-minimum-input-length 2 "Increase activation threshold to reduce lag")

  ;; Cleanup mode-line information
  (anzu-mode-lighter "" "Remove mode-name from results")
  (anzu-replace-to-string-separator "")

  :bind (;; Keybindings M-% and C-M-% do not change
         ([remap query-replace] . anzu-query-replace)
         ([remap query-replace-regexp] . anzu-query-replace-regexp)

         :map isearch-mode-map
         ;; Use Anzu-mode for replacing from isearch results (C-s or C-f)
         ([remap isearch-query-replace] . anzu-isearch-query-replace)
         ([remap isearch-query-replace-regexp] . anzu-isearch-query-replace-regexp)))
#+end_src

*** Display Current Function

#+begin_src emacs-lisp
;; Display current function() in mode-line
(use-package which-func
  :commands which-function-mode
  :hook (prog-mode . which-function-mode))
#+end_src

** Spacious Padding

=spacious-padding-mode= increases the space or "padding" around several elements
of the Emacs interface, such as window dividers, the internal frame border, and
padding of the mode-line, and more. The idea is to produce a more comfortable
presentation.

#+begin_src emacs-lisp
  (use-package spacious-padding
    :hook (after-init . spacious-padding-mode)
    :custom
    (spacious-padding-widths
     '( :internal-border-width 10 ;; Space between frame & contents
        :right-divider-width 10   ;; Space between side-by-side windows
        :fringe-width 8           ;; Fringe on either side of window
        :header-line-width 4      ;; Space surrpounding 'header-line'
        :mode-line-width 2        ;; Space surrounding 'mode-line'
        :scroll-bar-width nil))   ;; 'scroll-bar' disabled
    (spacious-padding-subtle-mode-line t))
#+end_src

** Provide init-ui.el

#+begin_src emacs-lisp
(provide 'init-ui)
;;; init-ui.el ends here
#+end_src

* Org-Mode
:PROPERTIES:
:ID:       1360c936-229c-44fd-b71c-30f66960d23a
:header-args: :tangle modules/init-org.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-org.el")>>
#+end_src

** General Settings
:PROPERTIES:
:ID:       1ef23429-c87a-4921-8dfc-f3169a907451
:END:

#+begin_src emacs-lisp
(use-package org
  :defer t
  :bind (("C-c l" . org-store-link)
         ("C-c a" . org-agenda)
         ("C-c c" . org-capture))
  :hook ((org-src-mode . whitespace-cleanup)
         ;; Automatic break line at 'current-fill-column' (line wrapping)
         (org-mode . turn-on-auto-fill))
  :custom
  (org-ellipsis " "          "Configured by 'org-modern'")
  (org-startup-folded t      "Always fold headers")
  (org-startup-indented t    "Visually indent headers/blocks at startup")
  (org-adapt-indentation t   "Align contents with heading")
  (org-element-use-cache nil "Avoid 'org-element--cache' error")
  (org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id))
#+end_src

** Org Table of Contents

=org-make-tock= is an Emacs package providing =org-make-toc-mode= that, when
activated, generates a "Table of Contents" (=TOC=) for =org= files. This makes it
easier to navigate large documents. Calling ~org-make-toc-insert~ adds a custom
~:TOC:~ property to the current header. The function ~org-make-toc~ updates the =TOC=
in the current buffer.

#+begin_src emacs-lisp
(use-package org-make-toc
  :after org
  :hook ((org-mode . org-make-toc-mode)
         (org-mode . (lambda ()
                       ;; 'nil' specifies that this is not a "local" addition
                       ;; 't' ensures the hook is buffer-local
                       (add-hook 'before-save-hook #'org-make-toc nil t)))))
#+end_src

** Org UI
