emacs/.emacs.d/README.org
*** TODO Modernize UI in Org-Mode

=org-modern= is an Emacs package providing =org-modern-mode= that, when activated,
adds a clean and efficient =org= style. The =org-blocks= are particularly nicely
decorated.

*N.B.* ~org-startup-indented t~ is set in the [[id:1ef23429-c87a-4921-8dfc-f3169a907451][General Settings]] section. Doing so
disables the fringe area of the block and "bracket" provided by =org-modern= (see
[[https://github.com/jdtsmith/org-modern-indent][org-modern-indent]]). Personally, I found the brackets distracting.

#+begin_src emacs-lisp :tangle no
(use-package org-modern
  :after (org)
  :init (global-org-modern-mode)
  :hook ((org-mode                 . org-modern-mode)
         (org-agenda-finalize-hook . org-modern-agenda))
  :commands (org-modern-mode org-modern-agenda))
#+end_src

*** Hide Emphasis Markers

By default, =Doom Themes= stylizes text surrounded by emphasis markers (see [[id:671dbaef-69f8-4ea6-870f-a72ebf5e13d7][Doom
Themes]]). As such, it is not necessary to display the emphasis markers. The
minor-mode =org-appear-mode= reveals the markers if the cursor moves in between
marker pairs.

#+begin_src emacs-lisp
(setopt org-hide-emphasis-markers t)

(use-package org-appear
  :after (org)
  :hook (org-mode . org-appear-mode)
  :custom (org-appear-inside-latex t))
#+end_src

** Org Behavior
*** Speed Commands

=org-use-speed-commands= settings controls whether certain single-key shortcuts
known as /speed commands/ are enabled when the cursor is at the beginning of a
headline. Below, we set the value to a custom lambda function (copied from
[[https://www.reddit.com/r/orgmode/comments/ded3g8/comment/f2x1u1o/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button][reddit]]) that enables the use of speed commands if cursor is on _any_ of the
leading stars.

*N.B.* If ~non-nil~, move cursor to start of any headline and call ~?~ to view list
of available speed commands.

#+begin_src emacs-lisp
;; ? speed-key opens Speed Keys help.
(setopt org-use-speed-commands
      (lambda ()
        (and (looking-at org-outline-regexp)
             (looking-back "^\**"))))
#+end_src

*** Archive

These are previous settings that I am not sure whether I want to include in
this configuration.

#+begin_src emacs-lisp :tangle no
;; 'C-a/e' jump to start-end of headline text
(setopt org-special-ctrl-a/e t)

;; 'C-k' behave different on headline text
(setopt org-special-ctrl-k t)

;; Do not delete hidden subtree with 'C-k'
(setopt org-ctrl-k-protect-subtree t)
#+end_src

** Org Babel
*** Languages

=org-babel-load-languages= setting specifies the languages which can be evaluated
in =org= buffers, which must be loaded using the function
~org-babel-do-load-languages~.

#+begin_src emacs-lisp
(org-babel-do-load-languages 'org-babel-load-languages
                             '((emacs-lisp . t)
                               (shell . t)))
#+end_src

*** Add Org-Block Templates

An =org-block= is a special section of text and possess syntax that distinguish
it from the surrounding content. Though there are many types of =org-blocks=,
they all share the same structure and start/end with ~#+BEGIN_<type>~ and
~#+END_<type>~.

Due to the shared structure, it is possible to define custom blocks via the
=org-structure-template-alist= setting and insert by calling
=org-insert-structure-template= (~C-c C-,~). Here, we define a few block templates
we anticipate using frequently.

#+begin_src emacs-lisp
(setopt org-structure-template-alist
        '(("x" . "example")
          ("q" . "quote")
          ("e" . "src emacs-lisp")
          ("m" . "src emacs-lisp :tangle modules/init-XXX.el")
          ("s" . "src sh")
          ("p" . "src python")))
#+end_src

*** Turn Off Confirmation

=org-confirm-babel-evaluate= setting, when set to ~t~, prompts the user to confirm
whether they intended to evaluate the code block. *Annoying*.

#+begin_src emacs-lisp
(setopt org-confirm-babel-evaluate nil)
#+end_src

*** Org-Edit-Special Buffer
**** Preserve Indentation

=org-src-preserve-indentation= setting, when set to ~t~, remove leading whitespace
automatically inserted when exiting the =org-edit-special= buffer.

#+begin_src emacs-lisp
(setopt org-src-preserve-indentation t)
#+end_src

**** Window Setup

=org-src-window-setup= setting controls how the source code edit buffer is
displayed. Setting to ~'current-window~ ensures that the widow always opens in
the current buffer.

#+begin_src emacs-lisp
(setopt org-src-window-setup 'current-window)
#+end_src

**** Turn off Exit Prompt

=org-src-ask-before-returning-to-edit-buffer= setting, when ~t~, prompts the user
before returning to an active source code editing buffer. This prevents
conflicting changes should the user switch back to the current buffer and make
changes to the =src-block= of an active =org-edit-special= buffer.

#+begin_src emacs-lisp
(setopt org-src-ask-before-returning-to-edit-buffer t)
#+end_src

*** FIX: Display ANSI Error Colors

#+begin_src emacs-lisp
;; From https://github.com/emacs-jupyter/jupyter/issues/366
(defun display-ansi-colors ()
  (ansi-color-apply-on-region (point-min) (point-max)))
#+end_src

** Images in Org
:PROPERTIES:
:ID:       c934464b-8b3c-4203-ac56-d916e21d470c
:END:
:RELATED:
+ [[id:0bdd31cb-56e6-4709-8294-a6c701dad660][Images]]
:END:
*** Show Inline Images At Open

=org-startup-with-inline-images= setting, when set to ~t~, displays inline images
when opening an =org= file. If ~nil~, only the links are displayed in the =org=
buffer.

#+begin_src emacs-lisp
(setopt org-startup-with-inline-images t)
#+end_src

*** Display Inline Remote Images

=org-display-remote-inline-images= setting controls whether images from remote
URLs (like websites) are displayed inline. Setting to ~'cache~ caches inline
images such that re-opening the file does not require re-downloading the
images.

#+begin_src emacs-lisp
(setopt org-display-remote-inline-images 'cache)
#+end_src

*** Refresh Images After Executing Code

Figures generated in src-blocks are not refreshed automatically. The following
changes ensure that the shown image is the "latest" version of that figure.

#+begin_src emacs-lisp
(add-hook 'org-babel-after-execute-hook
          (lambda () (org-display-inline-images nil t)))
#+end_src

** Org-Agenda
:PROPERTIES:
:ID:       17a0becd-af6d-47b9-8979-296bbdfa0f36
:END:
*** Background

=Org-agenda= is a tool in =org= for viewing, managing, and organizing tasks,
appointments, and/or projects. =Org-agenda= files (~.org~) are the source from
which the agenda extracts information, and are specified by defining
~org-agenda-files~.

Within an =org-agenda= file, header levels are used to structure content
hierarchically. The hierarchy makes it easy to break tasks into manageable
parts, with lower levels inheriting context from higher ones. For example a
TODO item under a project heading naturally belongs to that project.

Related, it is possible to define =org-capture= templates to standardize the
definition of -- and quickly insert -- TODO items.

*** Approach
:PROPERTIES:
:ID:       d8b34f34-e59a-4ac7-8184-58bbe224c9b9
:END:

I intend to use =org-agenda= to track the progress of ongoing personal- and
work-related TODO =tasks= or =projects=.

Here, a =task= is a TODO item with an individual deliverable such as "Review
Merge Request" or "Add Package X to Emacs Config". A =task= like "Review Merge
Request" may require multiple steps, like reviewing individual files.

Alternatively, a =project= is a goal that requires the completion of multiple
deliverables (i.e. =tasks=). For example, a =project= may include "Deploy an ML
model" which requires the sequential completion of "Perform EDA",
"Train/Evaluate ML Model", and "Build API"; each would require their own merge
request. A =project= is defined as a top-level header and related =tasks= will be
filed as second-level headers.

For the sake of simplicity, I delineate TODO items as either related to
"personal" or "work" and store them accordingly in =agenda_personal.org= and
=agenda_work.org=. These agenda files are stored in the variable ~my-persist-dir~
directory previously defined in the [[id:a0a6ce0f-55d9-415f-a70c-48716e9d8c61][Tidy Emacs Directory]] section.

_Carefully organizing TODO headers seems tedious_. Instead, this configuration
defines numerous =org-agenda= "views" to parse and group =tasks= and/or
=projects=. This is made possible through the configuration and use of:

+ TODO state :: Defines "action" state of the item
  - TODO states will be consistent across agenda files
  - Example :: ~TODO~, ~ACTIVE~, ~HOLD/WAIT~, ~COMPLETE~, ~MERGED~, ~DROPPED~
  - Example :: ~REVIEW~, ~COMMENT~, ~MESSAGE~

+ Tags :: Define "subject"-specific context to task
  - File Tag :: Tag defined in ~org-agenda-files~
    * Example :: ~:personal:~ and ~:work:~
  - Subject Tag :: Tag defined generally in config
    * Example :: ~bug~, ~note~, ~emacs~, ~devtools~, ~project~

+ Org-Header Property :: Header properties provide additional context
  - ~:project:~ + =org-super-agenda= package used to organize =tasks= belonging to a
    single =project=
  - Other properties may log ~:git_issue:~, ~:branch:~, or ~:repo:~

=Org-capture= templates are used to quickly insert =task= and =project= items. *N.B.*
Calling ~M-x org-refile~ (~C-c C-w~) instead of ~C-c C-c~ will "re-file" a =task= item
under a =project= top-level header.

*** Agenda Files
:PROPERTIES:
:ID:       4482073c-1c7e-4457-b196-cd38e1471f05
:END:

=org-agenda-files= variable defines the file(s) and/or directory(s) to be used
for agenda display.

#+begin_src emacs-lisp
(defconst my-agenda-dir (expand-file-name "agendas" user-cloud-path))

;; Create my-agenda-dir if it does not already exist in the cloud
(unless (file-directory-p my-agenda-dir)
  (make-directory my-agenda-dir))

(setopt org-agenda-files (list my-agenda-dir))
#+end_src

Here, we create shorthand variable names for specific agenda files, which
simplifies [[id:7fbf08ac-d4c9-4605-9f44-94570c2a7273][Agenda Capture Templates]] where we must specify the destination file
of the TODO template.

#+begin_src emacs-lisp
;; Constants used by org-capture templates
(defconst my-agenda-file-work (concat my-agenda-dir "agenda_work.org"))
(defconst my-agenda-file-personal (concat my-agenda-dir "agenda_personal.org"))
#+end_src

*** Agenda Window Behavior

=org-agenda-window-setup= setting specifies how the agenda buffer should be
displayed. Setting ~'only-window~ shows the agenda in in full screen.

Setting =org-agenda-restore-windows-after-quit= to ~t~ restores the window
configuration after exiting the agenda view.

#+begin_src emacs-lisp
(setopt org-agenda-window-setup 'only-window
        org-agenda-restore-windows-after-quit t)
#+end_src

*** Agenda TODO Settings
**** Agenda TODO Keywords

=org-todo-keywords= variable defines list(s) of TODO entry keyword sequences and
their interpretation. Calling ~M-x org-todo~ (~C-c C-t~) inserts or changes the
keyword of the =org= header at point.

Special characters assigned to the keyword include:

+ alpha :: Fast-state selection of keyword, configured in [[id:4f1ecc02-a588-4162-8f00-6d391e10bd4d][Fast TODO Selection]]
+ @ :: Add note and time to state change
+ ! :: Record only the time of the state change

The logging behavior of notes and timestamps are configured in [[id:c2de3b63-12ca-4c34-921c-0c518665eb40][Agenda TODO
Logging]].

*N.B.* The ~"|"~ keyword signifies that the subsequent keywords are a terminal
state. In other words, no further action is necessary.

#+begin_src emacs-lisp
(setopt org-todo-keywords '((sequence "TODO(t!)"
                                      "ACTIVE(a!)"
                                      "VERIFY(v@)"
                                      "HOLD/WAIT(h@)"
                                      "REVIEW(r@)"
                                      "COMMENT(c@)"
                                      "MESSAGE(m@)"
                                      "|" "DONE(d!)"
                                      "MERGED(M!)"
                                      "DELEGATED(o@)"
                                      "DROPPED(D@)")))
#+end_src

**** Fast TODO Selection
:PROPERTIES:
:ID:       4f1ecc02-a588-4162-8f00-6d391e10bd4d
:END:

=org-use-fast-todo-selection= setting, when set to ~'auto~, enables the fast
selection of TODO states. Calling ~M-x org-todo~ (~C-c C-t~) will open a pop-up
menu showing the available TODO keywords, each assigned to a specific key.

#+begin_src emacs-lisp
(setopt org-use-fast-todo-selection 'auto)
#+end_src

**** Agenda TODO Logging
:PROPERTIES:
:ID:       c2de3b63-12ca-4c34-921c-0c518665eb40
:END:

=org-log-into-drawer= setting, when set to ~t~, stores logs in a =drawer= below the
heading. This improves readability by separating state-change notes in a
separate (collapsible) area. Setting =org-log-states-order-reversed= to ~nil~ means
the latest note entry will be located at the bottom of the list.

#+begin_src emacs-lisp
(setopt org-log-into-drawer t
        org-log-states-order-reversed nil)
#+end_src

