stow/emacs/.emacs.d/modules/init-org.el

(setopt org-hide-emphasis-markers t)

(use-package org-appear
  :after (org)
  :hook (org-mode . org-appear-mode)
  :custom (org-appear-inside-latex t))

;; ? speed-key opens Speed Keys help.
(setopt org-use-speed-commands
      (lambda ()
        (and (looking-at org-outline-regexp)
             (looking-back "^\**"))))

(org-babel-do-load-languages 'org-babel-load-languages
                             '((emacs-lisp . t)
                               (shell . t)))

(setopt org-structure-template-alist
        '(("x" . "example")
          ("q" . "quote")
          ("e" . "src emacs-lisp")
          ("m" . "src emacs-lisp :tangle modules/init-XXX.el")
          ("s" . "src sh")
          ("p" . "src python")))

(setopt org-confirm-babel-evaluate nil)

(setopt org-src-preserve-indentation t)

(setopt org-src-window-setup 'current-window)

(setopt org-src-ask-before-returning-to-edit-buffer t)

;; From https://github.com/emacs-jupyter/jupyter/issues/366
(defun display-ansi-colors ()
  (ansi-color-apply-on-region (point-min) (point-max)))

(setopt org-startup-with-inline-images t)

(setopt org-display-remote-inline-images 'cache)

(add-hook 'org-babel-after-execute-hook
          (lambda () (org-display-inline-images nil t)))

(defconst my-agenda-dir (expand-file-name "agendas" user-cloud-path))

;; Create my-agenda-dir if it does not already exist in the cloud
(unless (file-directory-p my-agenda-dir)
  (make-directory my-agenda-dir))

(setopt org-agenda-files (list my-agenda-dir))

;; Constants used by org-capture templates
(defconst my-agenda-file-work (concat my-agenda-dir "agenda_work.org"))
(defconst my-agenda-file-personal (concat my-agenda-dir "agenda_personal.org"))

(setopt org-agenda-window-setup 'only-window
        org-agenda-restore-windows-after-quit t)

(setopt org-todo-keywords '((sequence "TODO(t!)"
                                      "ACTIVE(a!)"
                                      "VERIFY(v@)"
                                      "HOLD/WAIT(h@)"
                                      "REVIEW(r@)"
                                      "COMMENT(c@)"
                                      "MESSAGE(m@)"
                                      "|" "DONE(d!)"
                                      "MERGED(M!)"
                                      "DELEGATED(o@)"
                                      "DROPPED(D@)")))

(setopt org-use-fast-todo-selection 'auto)

(setopt org-log-into-drawer t
        org-log-states-order-reversed nil)
