emacs/.emacs.d/README.org
**** Hierarchical TODO Statistics

As outlined in [[id:d8b34f34-e59a-4ac7-8184-58bbe224c9b9][Approach]], project-related =tasks= are organized in top-level
=project= headers. It is possible to display the fraction or percentage of
completed project-related tasks by adding ~[/]~ or ~[%]~ in the top-level
header. *N.B.* I include this in the =org-capture-templates=; see [[id:7fbf08ac-d4c9-4605-9f44-94570c2a7273][Agenda Capture
Templates]].

The following is copied from [[https://orgmode.org/manual/Breaking-Down-Tasks.html][orgmode.org]] to automatically change a =project= TODO
entry to DONE when all children =tasks= are completed.

#+begin_src emacs-lisp
(defun org-summary-todo (n-done n-not-done)
  "Switch entry to DONE when all sub-entries are done, to TODO otherwise."
  (let (org-log-done org-todo-log-states)   ; turn off logging
    (org-todo (if (= n-not-done 0) "DONE" "TODO"))))

(add-hook 'org-after-todo-statistics-hook #'org-summary-todo)
#+end_src

*** Agenda TAG Settings
**** Fast Tag Selection

Similar to [[id:4f1ecc02-a588-4162-8f00-6d391e10bd4d][Fast TODO Selection]], setting =org-use-fast-tag-selection= to ~'auto~
opens a TAG pop-um menu when calling ~M-x org-set-tags-command~ (~C-c C-q~).

#+begin_src emacs-lisp
(setopt org-use-fast-tag-selection 'auto)
#+end_src

**** Tag Keywords

=org-tag-alist= variable defines list of TAG keywords. Calling ~M-x
org-set-tags-command~ (~C-c C-q~) sets the tags for the current visible entry.

#+begin_src emacs-lisp
(setopt org-tag-alist
        '(("bug" . ?b)
          ("note" . ?n)
          ("emacs" . ?e)
          ("tools" . ?t)
          ("reviews" . ?r)
          ("project" . ?p)))
#+end_src

**** Align Tags

=org-auto-align-tags= setting, when set to ~t~, keeps tags aligned when modifying
headlines.

#+begin_src emacs-lisp
(setopt org-auto-align-tags t)
#+end_src

**** Exclude Tag Inheritance
:PROPERTIES:
:ID:       d2dad69f-1b9c-4f05-bfb7-a88a99d498dc
:END:

By default, =org-use-tag-inheritance= is set to ~t~. Therefore, second-level =task=
items will inherit tags assigned to the top-level =project= header. Mentioned in
[[id:d8b34f34-e59a-4ac7-8184-58bbe224c9b9][Approach]], a =project= TODO is defined as a top-level header and related =tasks=
will be filed as second-level headers. I intend to use the ~:project:~ tag to
define =project= TODO. Adding ~:project:~ to =org-tags-exclude-from-inheritance=
setting provides a way to delineate between =project= TODO and related =task=
items.

#+begin_src emacs-lisp
(setopt org-tags-exclude-from-inheritance '("project"))
(setopt org-use-property-inheritance '("project"))
#+end_src

*** Agenda Capture Templates
:PROPERTIES:
:ID:       7fbf08ac-d4c9-4605-9f44-94570c2a7273
:END:

#+begin_src emacs-lisp
(setopt org-capture-templates
        '(("w" "WORK Templates")
          ("wp" "Work Project" entry (file my-agenda-file-work)
           "* TODO %^{Project} [/] %(org-set-tags \"project\")
:PROPERTIES:
:project: %^{project-name}
:END:
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :kill-buffer t)

          ("wt" "Work Todo (repo)" entry (file my-agenda-file-work)
           "* TODO %^{Task} %^G
:PROPERTIES:
:repo: %^{Repository}
:branch: %^{Branch}
:git_issue: #%^{Git Issue|None}
:merge_request: !%^{MR|None}
:END:
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :jump-to-captured t)

("wT" "Work Todo (no repo)" entry (file my-agenda-file-work)
           "* TODO %^{Task} %^G
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :jump-to-captured t)

          ("wr" "Work Review" entry (file my-agenda-file-work)
           "* REVIEW %^{Task} (org-set-tags \"review\")
:PROPERTIES:
:repo: %^{Repository}
:branch: %^{Branch}
:merge_request: !%^{MR|None}
:requester: %^{Requester}
:END:
:LOGBOOK:
- State \"REVIEW\"       from              %U
  %?
:END:"
           :empty-lines 1
           :jump-to-capture t)

          ("p" "PERSONAL Templates")
          ("pp" "Personal Product" entry (file my-agenda-file-personal)
           "* TODO %^{Project} [/] %(org-set-tags \"project\")
:PROPERTIES:
:project: %^{project-name}
:END:
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :kill-buffer t)

          ("pt" "Personal Todo" entry (file my-agenda-file-personal)
           "* TODO %^{Task} %^G
:PROPERTIES:
:repo: %^{Repository}
:branch: %^{Branch}
:END:
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :jump-to-captured t)))
#+end_src

*** Agenda View
**** Hide Tags in Agenda View

=org-agenda-remove-tags= setting, when set to ~t~, removes tags from the headline
copy in the agenda.

#+begin_src emacs-lisp
(setopt org-agenda-remove-tags t)
#+end_src

**** Modernize Org-Agenda

=org-super-agenda= is an Emacs package providing =org-super-agenda-mode= that, when
activated, enhances the =agenda-view= via customize-able grouping and filtering
options (implemented in [[id:dd0e3646-9554-4b81-89cc-e48e2dd485bc][Agenda Custom Commands]]).

#+begin_src emacs-lisp
(use-package org-super-agenda
  :defer t
  :after org
  :hook (org-agenda-mode . org-super-agenda-mode)
  :custom (org-super-agenda-header-prefix " ")
  :config
  (set-face-attribute 'org-super-agenda-header nil :weight 'bold))
#+end_src

**** Agenda Custom Commands
:PROPERTIES:
:ID:       dd0e3646-9554-4b81-89cc-e48e2dd485bc
:END:

=org-agenda-custom-commands= setting specifies different "views" of our TODO
items.

+ :discard :: Used to isolate tasks displayed in agenda view
  - [[id:4482073c-1c7e-4457-b196-cd38e1471f05][Agenda Files]] contain at least one ~:filetag~ which is useful for isolating
    work- or personal-specific tasks

+ :auto-parent :: Set to ~t~ groups tasks under a parent header in agenda view
  - Non-project related tasks are grouped under "Other Items" header

+ :discard (:tag "project") :: To drop Project TODO header by excluding tasks
  with ~:project:~ header
  - While project-related tasks are grouped under a parent header, the Project
    header in the agenda files are considered as a separate TODO -- which is
    displayed under "Other Items" header. *Annoying*.
  - ~:project:~ tag not inherited by project-related tasks (see [[id:d2dad69f-1b9c-4f05-bfb7-a88a99d498dc][Exclude Tag Inheritance]])


#+begin_src emacs-lisp
(setq org-agenda-custom-commands
      '(("w" "MLP: Project Planning"
         ((alltodo "" ((org-agenda-overriding-header "Work Projects")
                       (org-super-agenda-groups
                        ;; 'my-agenda-file-work' has "work" filetag
                        '((:discard (:not (:tag ("work"))))
                          (:auto-parent t)
                          (:discard (:tag "project"))))))))
        ("r" "MLP: Merge Request Review"
         ((alltodo "" ((org-agenda-overriding-header "MLP: Active MRs")
                       (org-super-agenda-groups
                        '((:discard (:not (:tag "work" "review")))))))))
        ("p" "Personal"
         ((alltodo "" ((org-agenda-overriding-header "Personal Projects")
                       (org-super-agenda-groups
                        '((:discard (:not (:tag "personal")))
                          (:auto-parent t)
                          (:discard (:tag "project"))))))))))
#+end_src

** Org-Block-Extras

The custom =org-block-extras= package provides additional functionality mirror
features found in =Jupyter Notebooks= such as the ability to quickly insert an
=org-block= possessing similar properties as the previous/next.

#+begin_src emacs-lisp
(use-package org-block-extras
  :after (org)
  :commands (org-previous-block
             org-next-block
             obe-insert-prev-block
             obe-insert-next-block)
  :load-path "lisp"
  :bind (:map org-mode-map
              ("M-p" . org-previous-block)
              ("M-n" . org-next-block)
              ("M-P" . obe-insert-prev-block)
              ("M-N" . obe-insert-next-block)
              ("M-D" . obe-kill-block)
              ("M-W" . obe-copy-block)
              ("C-c M-p" . obe-execute-above)
              ("C-c M-n" . obe-execute-below))
  :hook (before-save . (lambda ()
                         (when (eq major-mode 'org-mode)
                           (obe-remove-empty-results)))))
#+end_src

** Provide init-org.el

#+begin_src emacs-lisp
(provide 'init-org)
;;; init-org.el ends here
#+end_src

* Completion
:PROPERTIES:
:header-args: :tangle modules/init-completion.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-completion.el")>>
#+end_src

** Vertico
:RELATED:
+ Recommended by =vertico= author ::
  - [[id:e010f1a6-c723-4ca1-bf39-62b3a9672797][Minibuffer History]]
  - [[id:dfe5aad6-6c0b-4e06-8c83-028a59bb9ad1][Recursive Minibuffer]]
  - [[id:bbc9b953-b553-4928-a0ef-daf6df48a1f8][Read-only Minibuffer]]
  - [[id:51c833dd-b403-40e5-8359-f3b6f15193ff][Close Minibuffer Regardless of Point Location]]
+ [[id:8a9a6083-929e-4329-b009-c33529b0e5a7][Spell Checking]]:: Uses =vertico-multiform= for =jinx= recommendations
:END:

=vertico= is an Emacs package providing =vertico-mode= that, when activated,
provides an efficient completion framework that enhances Emacs' built-in
minibuffer completion. Completion candidates are displayed vertically in the
minibuffer.

The package includes several extensions:

+ vertico-directory :: Convenient directory navigation commands
+ vertico-repeat :: Command to repeat last completion session
+ vertico-grid :: Display candidates in grid, not as list
+ vertico-multiform :: Control display of candidates per mode

*N.B.* Author recommends activating =savehist-mode= to store previous completion
candidates (see [[https://github.com/minad/vertico][github/vertico]]).

#+begin_src emacs-lisp
(use-package vertico
  :defer t
  ;; :init recommended by author
  :init (vertico-mode)
  :custom
  (vertico-cycle t "Return to top of list")
  (vertico-count 10 "N candidate suggestions")
  ;; Save 'vertico' session for 'vertico-repeat' extension
  :hook (minibuffer-setup . vertico-repeat-save))

;; Copied from https://github.com/minad/vertico?tab=readme-ov-file
(use-package vertico-directory
  :after vertico
  :ensure nil
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word))
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src

