stow/emacs/.emacs.d/modules/init-org.el

(defun org-summary-todo (n-done n-not-done)
  "Switch entry to DONE when all sub-entries are done, to TODO otherwise."
  (let (org-log-done org-todo-log-states)   ; turn off logging
    (org-todo (if (= n-not-done 0) "DONE" "TODO"))))

(add-hook 'org-after-todo-statistics-hook #'org-summary-todo)

(setopt org-use-fast-tag-selection 'auto)

(setopt org-tag-alist
        '(("bug" . ?b)
          ("note" . ?n)
          ("emacs" . ?e)
          ("tools" . ?t)
          ("reviews" . ?r)
          ("project" . ?p)))

(setopt org-auto-align-tags t)

(setopt org-tags-exclude-from-inheritance '("project"))
(setopt org-use-property-inheritance '("project"))

(setopt org-capture-templates
        '(("w" "WORK Templates")
          ("wp" "Work Project" entry (file my-agenda-file-work)
           "* TODO %^{Project} [/] %(org-set-tags \"project\")
:PROPERTIES:
:project: %^{project-name}
:END:
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :kill-buffer t)

          ("wt" "Work Todo (repo)" entry (file my-agenda-file-work)
           "* TODO %^{Task} %^G
:PROPERTIES:
:repo: %^{Repository}
:branch: %^{Branch}
:git_issue: #%^{Git Issue|None}
:merge_request: !%^{MR|None}
:END:
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :jump-to-captured t)

("wT" "Work Todo (no repo)" entry (file my-agenda-file-work)
           "* TODO %^{Task} %^G
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :jump-to-captured t)

          ("wr" "Work Review" entry (file my-agenda-file-work)
           "* REVIEW %^{Task} (org-set-tags \"review\")
:PROPERTIES:
:repo: %^{Repository}
:branch: %^{Branch}
:merge_request: !%^{MR|None}
:requester: %^{Requester}
:END:
:LOGBOOK:
- State \"REVIEW\"       from              %U
  %?
:END:"
           :empty-lines 1
           :jump-to-capture t)

          ("p" "PERSONAL Templates")
          ("pp" "Personal Product" entry (file my-agenda-file-personal)
           "* TODO %^{Project} [/] %(org-set-tags \"project\")
:PROPERTIES:
:project: %^{project-name}
:END:
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :kill-buffer t)

          ("pt" "Personal Todo" entry (file my-agenda-file-personal)
           "* TODO %^{Task} %^G
:PROPERTIES:
:repo: %^{Repository}
:branch: %^{Branch}
:END:
:LOGBOOK:
- State \"TODO\"       from              %U
  %?
:END:"
           :empty-lines 1
           :jump-to-captured t)))

(setopt org-agenda-remove-tags t)

(use-package org-super-agenda
  :defer t
  :after org
  :hook (org-agenda-mode . org-super-agenda-mode)
  :custom (org-super-agenda-header-prefix "❯ ")
  :config
  (set-face-attribute 'org-super-agenda-header nil :weight 'bold))

(setq org-agenda-custom-commands
      '(("w" "MLP: Project Planning"
         ((alltodo "" ((org-agenda-overriding-header "Work Projects")
                       (org-super-agenda-groups
                        ;; 'my-agenda-file-work' has "work" filetag
                        '((:discard (:not (:tag ("work"))))
                          (:auto-parent t)
                          (:discard (:tag "project"))))))))
        ("r" "MLP: Merge Request Review"
         ((alltodo "" ((org-agenda-overriding-header "MLP: Active MRs")
                       (org-super-agenda-groups
                        '((:discard (:not (:tag "work" "review")))))))))
        ("p" "Personal"
         ((alltodo "" ((org-agenda-overriding-header "Personal Projects")
                       (org-super-agenda-groups
                        '((:discard (:not (:tag "personal")))
                          (:auto-parent t)
                          (:discard (:tag "project"))))))))))

(use-package org-block-extras
  :after (org)
  :commands (org-previous-block
             org-next-block
             obe-insert-prev-block
             obe-insert-next-block)
  :load-path "lisp"
  :bind (:map org-mode-map
              ("M-p" . org-previous-block)
              ("M-n" . org-next-block)
              ("M-P" . obe-insert-prev-block)
              ("M-N" . obe-insert-next-block)
              ("M-D" . obe-kill-block)
              ("M-W" . obe-copy-block)
              ("C-c M-p" . obe-execute-above)
              ("C-c M-n" . obe-execute-below))
  :hook (before-save . (lambda ()
                         (when (eq major-mode 'org-mode)
                           (obe-remove-empty-results)))))

(provide 'init-org)
;;; init-org.el ends here
