emacs/.emacs.d/README.org
** Orderless

=orderless= is an Emacs package that enhances completion style in the minibuffer
by allowing flexible, non-sequential matching on input patters. For example, if
we are searching for a buffer named =project-report.txt=, entering ~report txt
project~ would return the expected file instead of typing out the complete name.

#+begin_src emacs-lisp
;; Copied from https://github.com/oantolin/orderless/tree/master
(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src

** Marginalia

=marginalia= is an Emacs package providing =marginalia-mode= that, when activated,
enhances completion by providing additional annotation and contextual
information alongside candidates. In the minibuffer, for example, =marginalia=
will add file size or date modified.

#+begin_src emacs-lisp
(use-package marginalia
  :init (marginalia-mode 1))
#+end_src

** Consult
:PROPERTIES:
:ID:       8b393fcc-9d43-4afb-b249-9a72bc6089ea
:END:
:RELATED:
+ [[id:614d6cd5-6eb8-40cc-8ed1-538bcdca253d][Consult-Denote Extension]]
:END:

=consult= is an Emacs package that provides a powerful and flexible completion
and selection framework that streamlines various interactive commands. For
example, calling ~consult-buffer~ will preview the buffer as completion options
are scrolled over in the minibuffer.

#+begin_src emacs-lisp
;; Copied from https://github.com/minad/consult
(use-package consult
  :bind (;; C-c bindings in `mode-specific-map'
         ("C-c M-x" . consult-mode-command)
         ("C-c h" . consult-history)
         ("C-c k" . consult-kmacro)
         ("C-c m" . consult-man)
         ("C-c i" . consult-info)
         ([remap Info-search] . consult-info)
         ;; C-x bindings in `ctl-x-map'
         ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
         ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
         ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
         ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
         ("C-x t b" . consult-buffer-other-tab)    ;; orig. switch-to-buffer-other-tab
         ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
         ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
         ;; Custom M-# bindings for fast register access
         ("M-#" . consult-register-load)
         ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
         ("C-M-#" . consult-register)
         ;; Other custom bindings
         ("M-y" . consult-yank-pop)                ;; orig. yank-pop
         ;; M-g bindings in `goto-map'
         ("M-g e" . consult-compile-error)
         ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
         ("M-g g" . consult-goto-line)             ;; orig. goto-line
         ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
         ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
         ("M-g m" . consult-mark)
         ("M-g k" . consult-global-mark)
         ("M-g i" . consult-imenu)
         ("M-g I" . consult-imenu-multi)
         ;; M-s bindings in `search-map'
         ("M-s d" . consult-find)                  ;; Alternative: consult-fd
         ("M-s c" . consult-locate)
         ("M-s g" . consult-grep)
         ("M-s G" . consult-git-grep)
         ("M-s r" . consult-ripgrep)
         ("M-s l" . consult-line)
         ("M-s L" . consult-line-multi)
         ("M-s k" . consult-keep-lines)
         ("M-s u" . consult-focus-lines)
         ;; Isearch integration
         ("M-s e" . consult-isearch-history)
         :map isearch-mode-map
         ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
         ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
         ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
         ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
         ;; Minibuffer history
         :map minibuffer-local-map
         ("M-s" . consult-history)                 ;; orig. next-matching-history-element
         ("M-r" . consult-history))                ;; orig. previous-matching-history-element

  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)
  :init
  ;; Optionally configure the register formatting. This improves the register
  ;; preview for `consult-register', `consult-register-load',
  ;; `consult-register-store' and the Emacs built-ins.
  (setopt register-preview-delay 0.5
          register-preview-function #'consult-register-format)
  ;; Optionally tweak the register preview window. This adds thin lines,
  ;; sorting and hides the mode line of the window.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult to select xref locations with preview
  (setopt xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)

  :config
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis udsing the `consult-customize' macro.
  (consult-customize
   consult-theme
   :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-recent-file
   consult--source-project-recent-file
   :preview-key '("M-."))

  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (setopt consult-narrow-key "<")

  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (define-key consult-narrow-map (vconcat consult-narrow-key "?") #'consult-narrow-help)

  ;; By default `consult-project-function' uses `project-root' from project.el.
  ;; Optionally configure a different project root function.
  ;;;; 1. project.el (the default)
  ;; (setopt consult-project-function #'consult--default-project--function)
  ;;;; 2. vc.el (vc-root-dir)
  ;; (setopt consult-project-function (lambda (_) (vc-root-dir)))
  ;;;; 3. locate-dominating-file
  ;; (setopt consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
  ;;;; 4. projectile.el (projectile-project-root)
  ;; (autoload 'projectile-project-root "projectile")
  ;; (setopt consult-project-function (lambda (_) (projectile-project-root))))
  )
#+end_src

** Yasnippet

=yasnippets= is a 3rd party Emacs package that provides a powerful snippet
template system. Snippets are stored in =~/.emacs.d/snippets/= and can be
inserted by typing the snippet ~key:~ and then calling ~M-x yas-expand~.

The =consult-yasnippet= Emacs package expands [[id:8b393fcc-9d43-4afb-b249-9a72bc6089ea][Consult]] and provides consult-read
interface for snippets. Calling ~M-x consult-yasnippet~ will display all snippets
(and their ~key:~) available for the current mode.

*N.B* [[https://github.com/AndreaCrotti/yasnippet-snippets/tree/master][yasnippet-snippets]] contains a comprehensive list of snippets. Most are
irrelevant so the package is not currently included in the configuration.

#+begin_src emacs-lisp
(use-package yasnippet
  :config (yas-global-mode 1)
  :custom
  (yas-snippet-dirs (list (expand-file-name "snippets" user-emacs-directory))))

(use-package consult-yasnippet
  :after (consult yasnippet)
  :bind ("C-M-y" . consult-yasnippet)
  :config
  (global-unset-key (kbd "C-M-y")))
#+end_src

** Provide init-completion.el

#+begin_src emacs-lisp
(provide 'init-completion)
;;; init-completion.el ends here
#+end_src

* DIRED
:PROPERTIES:
:header-args: :tangle modules/init-dired.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-dired.el")>>
#+end_src


