emacs/.emacs.d/README.org
** dired

=dired=, short for "DIsk REDitor", is a /built-in/ Emacs package providing an
interface for file and directory management. With =dired=, it is possible to
navigate directories, view file details, and perform a wide range of file
operations directly within Emacs.

#+begin_src emacs-lisp
(use-package dired
  :ensure nil
  :commands dired
  :custom
  ;; -A :: Show hidden files but omit implied '.' and '..' targets
  ;; -h :: Make file sizes human-readable
  ;; -l :: Produce long=g, detailed listing (required by 'dired')
  ;; -v :: Sort file by version number
  ;; --group-directories-first :: List directories at top of buffer
  ;; --time-style=long-iso     :: List %Y-%m-%d %H:%M
  (dired-listing-switches (concat "-Ahlv"
                                  " --group-directories-first"
                                  " --time-style=long-iso"))

  ;; Refresh 'dired' buffer if directory changes
  (dired-auto-revert-buffer #'dired-buffer-changed-p)

  ;; If two 'dired' buffers open side-by-side, Emacs will suggest the
  ;; other buffer directory when moving files
  (dired-dwim-target t)

  :config
  ;; The variable 'dired-kill-when-opening-new-dired-buffer'
  ;; exists. However, there are use-cases for having multiple 'dired'
  ;; buffers open at the same time (see 'dired-dwim-target').
  (defun jh/dired-kill-all-buffers ()
    "Delete all open 'dired'-mode buffers."
    (interactive)
    (jh/kill-buffers-by-mode 'dired-mode)))
#+end_src

** dired-x

=dired-x= is a /built-in/ Emacs package providing extended and optional features to
=dired= including, but not limited to:

+ Omitted files :: =dired-omit-mode= tidies the =dired= buffer by hiding files
  based on regex patterns

+ Jumping to files :: Adds commands to quickly jump to files or directories in
  a project

#+begin_src emacs-lisp
(use-package dired-x
  :ensure nil
  :after dired
  ;; ':commands dired' removed in commit 67d0400
  :custom
  ;; Files to ignore in 'dired' buffer.
  (dired-omit-files (concat "\\`[.]?#\\|\\`[.][.]?\\'"
                            "\|"
                            (rx (or (: bos (or "\.DS_Store"
                                               "__MACOSX"
                                               "\.git")
                                       eos)
                                    (: bos "__pycache__")
                                    ".ipynb_checkpoints"
                                    "\.~.*#"))))
  :config
  ;; Must activate 'dired-omit-mode' to omit 'dired-omit-files'.
  (add-hook 'dired-after-readin-hook 'dired-omit-mode))
#+end_src

** dired-aux

=dired-aux= is a /built-in/ Emacs package providing auxiliary functions in
=dired=. The additional functionality includes, but is not limited to:

+ Bulk operations :: Handle operations on multiple files more robustly, such as
  renaming and copying

+ File compression and decompression :: Adds commands for compressing and
  decompressing files directly from a =dired= buffer

+ Backup and auto-save file cleanup :: Includes features to clean up backup
  files and other temporary files more effectively

#+begin_src emacs-lisp
(use-package dired-aux
  :ensure nil
  :after dired
  :commands dired
  :bind (:map dired-mode-map
              ;; 'f' calls 'dired-find-file'
              ("F" . dired-create-empty-file))
  :custom
  (dired-do-revert-buffer t "Revert buffer after any 'dired-do' operations"))
#+end_src

** wdired

=wdired= is a /built-in/ Emacs package providing the ability to make =dired=-buffers
_writable_. In other words, it is possible to edit file and directory names as if
they are regular text. This is advantageous for quickly renaming multiple
files.

#+begin_src emacs-lisp
(use-package wdired
  :ensure nil
  :after dired
  :commands dired
  :custom
  ;; Change permission using 'SPC'
  (wdired-allow-to-change-permissions t))
#+end_src

** diredfl

=direfl-mode= adds additional font lock rules to provide a more colorful =dired=
experience.

#+begin_src emacs-lisp
(use-package diredfl
  :after dired-mode
  :hook (dired-mode . diredfl-mode))

#+end_src

** Provide init-dired.el

#+begin_src emacs-lisp
(provide 'init-dired)
;;; init-dired.el ends here
#+end_src

* Development
:PROPERTIES:
:header-args: :tangle modules/init-dev.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-dev.el")>>
#+end_src

** Rainbow Delimiters

=rainbow-delimiters= is an Emacs package providing =rainbow-delimiters-mode= that,
when activated, improves code readability by visually distinguishing pairs of
delimiters using different colors.

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode))
#+end_src

** Highlight TODOs
:PROPERTIES:
:ID:       5e72d5f0-fdaf-491a-9a84-9806ee295d0a
:END:
:RELATED:
+ [[id:1ae14e20-459c-44ec-8c2a-b5f2f64116ac][Highlighting]]
:END:

=hl-todo= is an Emacs package providing =hl-todo-mode= that, when activated,
highlight TODO keywords in text files. Since =org= includes TODO tags, we will
only activate in =prog-mode=.

*Notable functions:*
+ hl-todo-next :: Jump to next TODO-keyword
+ hl-todo-previous :: Jump to previous TODO-keyword
+ hl-toqdo-occur :: Open ibuffer of all occurrences

#+begin_src emacs-lisp
(use-package hl-todo
  :hook (prog-mode)
  :custom
  (hl-todo-keyword-faces
   '(("TODO"   . "#FFBF00")
     ("FIXME"  . "#DE3163"))))
#+end_src

** Expand Region Selection

=expand-region= is an Emacs package that provides the ability to incrementally
expand a selected region of text. Calling ~er/expand-region~ selects an initial
region; ~=~ and ~-~ can then be used to expand or contract the selected region.

*N.B.* The package includes =python-mode-expandsions.el= and other modules that may
be of interest.

#+begin_src emacs-lisp
(use-package expand-region
  :commands er/expand-region
  :bind ("C-=" . er/expand-region))
#+end_src

** Project Navigation

=projectile= is an Emacs package providing =projectile-mode= that, when activated,
provides functionality to more quickly navigate, manage, and work with files
within a repository.

#+begin_src emacs-lisp
;; To provide project management + navigation features
(use-package projectile
  :bind-keymap ("C-c p" . projectile-command-map)
  :init (projectile-mode 1)
  :custom
  ;; Cache to prevent slow 'projectile-find-file' on larger projects
  (projectile-enable-caching t))
#+end_src

** Version Control
*** Magit

=magit= is an Emacs package that provides a text-based user interface to =git=
(otherwise referred to as a "git porcelain"). See [[https://magit.vc/][magit.vc]] for documentation.

#+begin_src emacs-lisp
(use-package magit
  :bind ("C-x g" . magit-status)
  :after nerd-icons
  :diminish magit-minor-mode
  :hook (git-commit-mode . (lambda () (setq fill-column 72)))
  :mode ("/\\.gitmodules\\'" . conf-mode)
  :custom
  ;; hide ^M chars at the end of the line when viewing diffs
  (magit-diff-hide-trailing-cr-characters t)

  ;; Limit legth of commit message summary
  (git-commit-summary-max-length 50)

  ;; Open status buffer in same buffer
  (magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)

  ;; Enable file icons in 'magit-status'
  (magit-format-file-function #'magit-format-file-nerd-icons)
  :config
  ;; Must define here to ensure underlying function defined in
  ;; 'init-emacs' is loaded before 'magit'.
  (defun my/magit-kill-all-buffers ()
    "Kill all buffers derived from 'magit-mode'."
    (interactive)
    (my/kill-buffers-by-mode 'magit-mode)))
#+end_src

*** Tweaks for CLI Git in Emacs

Command-line =git= is possible in =vterm=, however editing =EDITMSG= buffers can be
tedious. Since ~core.editor vim~ is set by default, =vim= bindings are required to
edit the message buffer. However, setting ~core.editor "emacs"~ will open the
=EDITMSG= buffer as a new window instead of in the current Emacs
instance. *Annoying!*

Alternatively we can install the =with-editor= package (part of =magit=) to open
the =EDITMSG= buffer inside the current Emacs instance and set ~git config
--global core.editor "emacsclient"~ to use Emacs bindings when editing the
message. See [[https://magit.vc/manual/with-editor/Using-With_002dEditor-commands.html][magit.vc/manual/with-editor]].

#+begin_src emacs-lisp
(use-package with-editor
  :after (vterm magit)
  :commands vterm
  :config
  ;; To use current Emacs instance as "the editor" in 'vterm'
  (add-hook 'vterm-mode-hook 'with-editor-export-editor)

  ;; Activate 'with-editor' for several git message buffers
  (add-to-list 'auto-mode-alist
               '("/\\(?:COMMIT\\|NOTES\\|TAG\\|PULLREQ\\)_EDITMSG\\'"
                 . with-editor-mode))

  ;; To use Emacs bindings in the EDITMSG buffer
  (shell-command "git config --global core.editor emacsclient"))
#+end_src

*** TODO Git-Gutter
:LOGBOOK:
- State "TODO"       from              [2025-05-08 Thu 12:12]
  Disabled until I can figure out why there is no fringe/gutter
:END:

=git-gutter= is an Emacs package providing =git-gutter-mode= that, when activated,
provides visual indication of changes to files inside a =git= repository. Colored
icons located in the gutter indicate which lines have been modified, added, or
deleted since the previous commit.

*N.B.* The mode does not play nice with =linum-mode=, so we must also install the
=git-gutter-fringe= package (see [[id:253507fc-cbf8-40a5-a490-c8651a7d44dd][Display Line Numbers in Fringe]]).

#+begin_src emacs-lisp :tangle no
(use-package git-gutter
  :hook ((prog-mode org-mode) . git-gutter-mode)
  :custom
  (git-gutter:modified-sign "=")
  (git-gutter:added-sign "+")
  (git-gutter:deleted-sign "-")
  :bind (("C-x P" . git-gutter:previous-hunk)
         ("C-x N" . git-gutter:next-hunk)
         ("C-x G" . git-gutter:popup-hunk))
  :config
  (use-package git-gutter-fringe
    :config (global-git-gutter-mode)))
#+end_src

** DevDocs

=devdocs-browser= is an Emacs package that provides an interface to [[https://devdocs.io/][DevDocs.io]], a
popular documentation aggregator for programming languages and
libraries. Documents must be installed, which are done programmatically and
stored in ~devdocs-browser-data-directory~.

#+begin_src emacs-lisp
(use-package devdocs-browser
  :bind ("C-h D" . devdocs-browser-open-in)
  :custom
  (devdocs-browser-data-directory user-settings-path)
  :config
  ;; Programmatically install documentation
  (dolist (doc '("python~3.11"
                 "pytorch~2"
                 "pandas~2"
                 "matplotlib~3.8"
                 "numpy~2.0"
                 "scikit_learn"))
    (devdocs-browser-install-doc doc)))
#+end_src

