emacs/.emacs.d/modules/init-dev.el

(use-package rainbow-delimiters
  :hook (prog-mode))

(use-package hl-todo
  :hook (prog-mode)
  :custom
  (hl-todo-keyword-faces
   '(("TODO"   . "#FFBF00")
     ("FIXME"  . "#DE3163"))))

(use-package expand-region
  :commands er/expand-region
  :bind ("C-=" . er/expand-region))

;; To provide project management + navigation features
(use-package projectile
  :bind-keymap ("C-c p" . projectile-command-map)
  :init (projectile-mode 1)
  :custom
  ;; Cache to prevent slow 'projectile-find-file' on larger projects
  (projectile-enable-caching t))

(use-package magit
  :bind ("C-x g" . magit-status)
  :after nerd-icons
  :diminish magit-minor-mode
  :hook (git-commit-mode . (lambda () (setq fill-column 72)))
  :mode ("/\\.gitmodules\\'" . conf-mode)
  :custom
  ;; hide ^M chars at the end of the line when viewing diffs
  (magit-diff-hide-trailing-cr-characters t)

  ;; Limit legth of commit message summary
  (git-commit-summary-max-length 50)

  ;; Open status buffer in same buffer
  (magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1)

  ;; Enable file icons in 'magit-status'
  (magit-format-file-function #'magit-format-file-nerd-icons)
  :config
  ;; Must define here to ensure underlying function defined in
  ;; 'init-emacs' is loaded before 'magit'.
  (defun my/magit-kill-all-buffers ()
    "Kill all buffers derived from 'magit-mode'."
    (interactive)
    (my/kill-buffers-by-mode 'magit-mode)))

(use-package with-editor
  :after (vterm magit)
  :commands vterm
  :config
  ;; To use current Emacs instance as "the editor" in 'vterm'
  (add-hook 'vterm-mode-hook 'with-editor-export-editor)

  ;; Activate 'with-editor' for several git message buffers
  (add-to-list 'auto-mode-alist
               '("/\\(?:COMMIT\\|NOTES\\|TAG\\|PULLREQ\\)_EDITMSG\\'"
                 . with-editor-mode))

  ;; To use Emacs bindings in the EDITMSG buffer
  (shell-command "git config --global core.editor emacsclient"))

(use-package devdocs-browser
  :bind ("C-h D" . devdocs-browser-open-in)
  :custom
  (devdocs-browser-data-directory user-settings-path)
  :config
  ;; Programmatically install documentation
  (dolist (doc '("python~3.11"
                 "pytorch~2"
                 "pandas~2"
                 "matplotlib~3.8"
                 "numpy~2.0"
                 "scikit_learn"))
    (devdocs-browser-install-doc doc)))
