emacs/.emacs.d/README.org
** Virtual Terminal

=vterm= is an Emacs package providing a terminal emulator inside Emacs. Based on
=libvterm=, a C library that enables near-native terminal performance.

#+begin_src emacs-lisp
(use-package vterm
  :defer t
  :commands (vterm vterm-mode vterm-other-window)
  ;; Requires compilation, which may not work without installing dependencies
  :init (setopt vterm-always-compile-module t)
  :config
  (defun my/vterm-new ()
  "Prompt the user for a new vterm buffer name and open it."
  (interactive)
  (let ((vterm-buffer-name (read-string "Enter new vterm buffer name: ")))
    (vterm (generate-new-buffer-name (concat "*" vterm-buffer-name "*"))))))
#+end_src

** Code-Cells

=code-cells= is an Emacs package that provides the ability to efficiently
navigate, edit and execute code split into cells according to certain magic
comments (i.e. regex pattern, ~code-cells-boundary-regexp~).

#+begin_src emacs-lisp
(use-package code-cells
  :hook ((python-mode emacs-lisp-mode)
         (prog-mode . outline-minor-mode))
  :bind (:map code-cells-mode-map
              ("C-c C-c" . code-cells-eval)
              ("M-p" . code-cells-backward-cell)
              ("M-n" . code-cells-forward-cell)
              ("M-D" . code-cells-kill)
              ("M-W" . code-cells-copy)
              ("M-I" . jh/code-cells-insert)
              ("C-<tab>" . outline-cycle))
  :custom
  (code-cells-eval-region-commands
   '((emacs-lisp-mode . eval-region)
     (lisp-interaction-mode . eval-region)
     (python-base-mode . jh/jupyter-eval-region-maybe)))
  :config
  (defun jh/jupyter-eval-region-maybe ()
    "Call 'jupyter-eval-region' if available, otherwise use shell."
    (if jupyter-current-client
        'jupyter-eval-region
      'python-shell-send-region))

  (defun jh/code-cells-insert ()
    (interactive)
    (when (not (bolp))
      (newline 2))
    (insert (substring code-cells-boundary-regexp 1))
    (newline 2))

  ;; TODO: Reduce redundant code; previously tried 'dolist'
  (add-hook 'emacs-lisp-mode-hook (lambda ()
                                    (setq-local code-cells-boundary-regexp "^;;; %%")))
  (add-hook 'python-mode-hook (lambda ()
                                (setq-local code-cells-boundary-regexp "^### %%"))))
#+end_src

** Lisp
*** Automatic Indentation

=aggressive-indent= is an Emacs package providing =aggressive-indent-mode= that,
when activated, correctly indents code as you type. Changes to indentation on
one line of a function, for example, automatically adjusts the remaining lines
of code. Primarily used as a "dumb" formatter for =emacs-lisp= code.

*N.B.* Less important for =python= as other code formatter packages exist.

#+begin_src emacs-lisp
(use-package aggressive-indent
  :hook (emacs-lisp-mode))
#+end_src

*** Elisp Documentation Lookup

=helpful= is an Emacs package extends the /built-in/ =help= package and
provides efficient, user-friendly documentation for =emacs-lisp=
functions, variables, keybindings, and more.

#+begin_src emacs-lisp
(use-package helpful
  :custom
  (helpful-max-buffers 1)
  :bind
  (("C-h k" . helpful-key)
   ("C-h f" . helpful-function)
   ("C-h c" . helpful-callable)
   ("C-h p" . helpful-at-point)
   ("C-h v" . helpful-variable)
   ("C-h m" . helpful-macro)))
#+end_src

** Yaml

#+begin_src emacs-lisp
(use-package yaml-mode
  :mode ("\\.yml\\'" "\\.yaml\\'"))
#+end_src

** Python
*** Basics

=python.el= is a /built-in/ Emacs package providing =python-mode= for editing python
files. The major-mode provides some fontification as well as syntax
highlighting, indentation, and movement functions.

*N.B.* The package also provides =inferior-python-mode= which runs a Python
interpreter (python shell) as a sub-process of Emacs. The =inferior python
process= does not contain fontification and cannot display images. This
configuration will instead rely on =Jupyter Kernels= (see [[id:4d2b331f-7ced-46b2-a764-db4ff2b79688][Jupyter REPLS]]).

#+begin_src emacs-lisp
(use-package python
  :ensure nil
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python" . python-mode)
  :custom
  ;; 3rd party py-files may have different indentation; disable if guess fails
  (python-indent-guess-indent-offest t)
  (python-indent-guess-indent-offset-verbose nil)
  ;; Modified pep-257 removes new-line at end of docstring
  (python-fill-docstring-style 'pep-257-nn))
#+end_src

*** Virtual Environments
**** Add Executable Path

The =exec-path-from-shell= package is a tool to ensure that Emacs correctly
inherits environment variables such as ~$PATH~ (bash convention) from your
shell. This is particularly relevant as we wish to make Emacs, and =eglot=, aware
of our =tool= virtual environment containing python applications. It is necessary
to add the =venv= path to ~exec-path~ as the applications will serve as the
back-end for various Emacs packages that provide, for instance, code formatting
or LSP functionality.

#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :defer t
  :config
  (exec-path-from-shell-initialize))
#+end_src

**** TODO Jupyter Kernels
:PROPERTIES:
:ID:       4d2b331f-7ced-46b2-a764-db4ff2b79688
:END:
:LOGBOOK:
- State "TODO"       from              [2025-05-08 Thu 12:15]
  Disable until figure out issue with ZMQ
:END:

=emacs-jupyter= is an Emacs package that provides an interface for working with
=Jupyter Kernels=. Specifically, the package makes it possible to use =Jupyter
Kernels= as the computational back-end of =org-mode= src-blocks, or to use the
kernel as a =REPL=.

#+begin_src emacs-lisp :tangle no
(use-package jupyter
  :demand t
  :after (:all org python ob)
  :custom
  (org-babel-default-header-args:jupyter-python
   '((:session . "py")
     (:kernel . "python3")
     (:comments . "link")
     (:async . "yes")))
  :config
  (require 'ob-jupyter))
#+end_src

The custom =jupyter-kernel-extras= package provides utilities for quickly
creating and removing =Jupyter Kernels= by calling ~jke-create-kernel~ and
~jke-delete-kernel~.

#+begin_src emacs-lisp :tangle no
(use-package jupyter-kernel-extras
  :commands (jke-create-kernel jke-delete-kernel)
  :load-path "lisp")
#+end_src

*** Doc-strings

=numpydoc= is an Emacs package to easily insert [[https://numpydoc.readthedocs.io/en/latest/format.html][NumPy]] style doc-strings in Python
function definitions. Alternatively, =sphinx-doc= makes it easier to insert
[[https://sphinx-rtd-tutorial.readthedocs.io/en/latest/docstrings.html][Sphinx]] style doc-strings.

*N.B.* Keybindings for ~numpydoc-generate~ and ~sphinx-doc~ assigned in [[id:d831e4e4-e9b1-480e-aa1a-a152d9707275][General.el]].

#+begin_src emacs-lisp
(use-package numpydoc
  :commands (numpydoc-generate)
  :custom
  ;; Redefine so '*args' and '**kwargs' /not/ ignored
  (numpydoc-ignored-params '("" "self" "cls" "*" "/")))

(use-package sphinx-doc
  :commands (sphinx-doc)
  :hook (python-mode . sphinx-doc-mode))
#+end_src

=python-docstring= is an Emacs package providing =python-docstring-mode= for
intelligently highlighting Python doc-strings. The package includes
~python-docstring-fill~ that overrides ~fill-paragraph~. *N.B.* Only works with
=epytext= and =sphinx= formats, which conflicts with =numpydoc=.

#+begin_src emacs-lisp
(use-package python-docstring
  :hook (python-mode . python-docstring-mode)
  :bind (:map python-mode-map
             ("M-q" . python-docstring-fill)))
#+end_src

** Provide init-dev.el

#+begin_src emacs-lisp
(provide 'init-dev)
;;; init-dev.el ends here
#+end_src

* Writing
:PROPERTIES:
:header-args: :tangle modules/init-writing.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-writing.el")>>
#+end_src

** Improve Navigation

=avy= is an Emacs package providing efficient navigation by allowing users to
jump to visible text within the buffer.

#+begin_src emacs-lisp
(use-package avy
  :bind (("M-j" . avy-goto-char-timer)  ;; orig. 'default-indent-new-line'
         :map isearch-mode-map
         ("M-j" . avy-isearch))
  :custom
  (avy-timeout-seconds 0.3 "Seconds before overlay appears")
  (avy-style 'pre "Overyly single char at beginning of word")
  :custom-face
  ;; Change colors to improve readability
  (avy-lead-face ((t (:background "#000000" :foreground "#33A4FF" :weight regular)))))
#+end_src

** Spell Checking
:PROPERTIES:
:ID:       8a9a6083-929e-4329-b009-c33529b0e5a7
:END:

Spell checking is important for both things like narratives and git
commits. The [[https://github.com/minad/jinx][jinx]] package is preferred over the builtin =flyspell= due to
efficiency, keybindings, and ability to save words to a dictionary.

The package uses the API of the =Enchant= library [[[https://abiword.github.io/enchant/][github/enchant]]] and only
analyses visible text (instead of the entire buffer). The =jinx= package requires
the following local packages to provide spell-checking. Both =enchant= and
=pkgconf= are Arch-specific. Dictionaries are provided by =nuspell= (the modern
version of =hunspell=). See [[https://github.com/minad/jinx][gitub/jinx]] for more details. In Arch, packages can be
download by ~yay enchant pkgconf hunspell~.

  + hunspell :: Spell-checker dictionaries
  + enchant :: Wrapper for spelling libraries
  + pkgconf :: Compiler; used by =jinx= to locate =enchant=

Useful commands include:
  + jinx-next / jinx-previous :: Jump to previous/next visible
    spelling error
  + jinx-correct-all :: Allow user to correct all spelling errors in
    buffer

*QUIRK:* Comments in =src-blocks= are only checked if viewed in an =org-edit-special=
buffer accessed via ~C-c '~ . This is because =jinx= only checks text possessing
specific face properties (see ~jinx-include-faces~ and ~jinx-exclude-faces~). When
coding, we are only interested in checking comments and doc-strings;
~tree-sitter-hl-face:comment~, for example extends this functionality to =.py=
files. To check a comment, we would need to remove =org-block= in
~jinx-exclude-faces~ at the expense of checking ALL of the code.

#+begin_src elisp
(use-package jinx
  :defer t
  :hook (org-mode text-mode prog-mode conf-mode)
  :bind (("C-c j c" . jinx-correct)
         ("C-c j a" . jinx-correct-all)
         ("C-c j d" . my/jinx-save-word-at-point))
  :custom
  ;; 'jinx-mode' only checks text possessing specific face properties like
  ;; 'font-lock-comment-face' in 'prog-mode' for example.
  (jinx-include-faces
   '((yaml-mode . conf-mode)
     (yaml-ts-mode . conf-mode)
     ;; Only check docstrings and comments; not strings
     (conf-mode font-lock-comment-face)
     (prog-mode font-lock-comment-face
                font-lock-doc-face
                tree-sitter-hl-face:comment
                tree-sitter-hl-face:doc)))

  (jinx-languages "en_GB")
  :config
  ;; Quickly save word-at-point to dictionary used by 'jinx'
  (defalias 'my/jinx-save-word-at-point (kmacro "C-c j c @ RET"))

  ;; 'jinx-correct' suggestions displayed as grid instead of long list
  (vertico-multiform-mode 1)
  (add-to-list 'vertico-multiform-categories
               '(jinx grid (vertico-grid-annotate . 20))))
#+end_src

** Denote
