emacs/.emacs.d/modules/init-dev.el

(use-package vterm
  :defer t
  :commands (vterm vterm-mode vterm-other-window)
  ;; Requires compilation, which may not work without installing dependencies
  :init (setopt vterm-always-compile-module t)
  :config
  (defun my/vterm-new ()
  "Prompt the user for a new vterm buffer name and open it."
  (interactive)
  (let ((vterm-buffer-name (read-string "Enter new vterm buffer name: ")))
    (vterm (generate-new-buffer-name (concat "*" vterm-buffer-name "*"))))))

(use-package code-cells
  :hook ((python-mode emacs-lisp-mode)
         (prog-mode . outline-minor-mode))
  :bind (:map code-cells-mode-map
              ("C-c C-c" . code-cells-eval)
              ("M-p" . code-cells-backward-cell)
              ("M-n" . code-cells-forward-cell)
              ("M-D" . code-cells-kill)
              ("M-W" . code-cells-copy)
              ("M-I" . jh/code-cells-insert)
              ("C-<tab>" . outline-cycle))
  :custom
  (code-cells-eval-region-commands
   '((emacs-lisp-mode . eval-region)
     (lisp-interaction-mode . eval-region)
     (python-base-mode . jh/jupyter-eval-region-maybe)))
  :config
  (defun jh/jupyter-eval-region-maybe ()
    "Call 'jupyter-eval-region' if available, otherwise use shell."
    (if jupyter-current-client
        'jupyter-eval-region
      'python-shell-send-region))

  (defun jh/code-cells-insert ()
    (interactive)
    (when (not (bolp))
      (newline 2))
    (insert (substring code-cells-boundary-regexp 1))
    (newline 2))

  ;; TODO: Reduce redundant code; previously tried 'dolist'
  (add-hook 'emacs-lisp-mode-hook (lambda ()
                                    (setq-local code-cells-boundary-regexp "^;;; %%")))
  (add-hook 'python-mode-hook (lambda ()
                                (setq-local code-cells-boundary-regexp "^### %%"))))

(use-package aggressive-indent
  :hook (emacs-lisp-mode))

(use-package helpful
  :custom
  (helpful-max-buffers 1)
  :bind
  (("C-h k" . helpful-key)
   ("C-h f" . helpful-function)
   ("C-h c" . helpful-callable)
   ("C-h p" . helpful-at-point)
   ("C-h v" . helpful-variable)
   ("C-h m" . helpful-macro)))

(use-package yaml-mode
  :mode ("\\.yml\\'" "\\.yaml\\'"))

(use-package python
  :ensure nil
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python" . python-mode)
  :custom
  ;; 3rd party py-files may have different indentation; disable if guess fails
  (python-indent-guess-indent-offest t)
  (python-indent-guess-indent-offset-verbose nil)
  ;; Modified pep-257 removes new-line at end of docstring
  (python-fill-docstring-style 'pep-257-nn))

(use-package exec-path-from-shell
  :defer t
  :config
  (exec-path-from-shell-initialize))

(use-package numpydoc
  :commands (numpydoc-generate)
  :custom
  ;; Redefine so '*args' and '**kwargs' /not/ ignored
  (numpydoc-ignored-params '("" "self" "cls" "*" "/")))

(use-package sphinx-doc
  :commands (sphinx-doc)
  :hook (python-mode . sphinx-doc-mode))

(use-package python-docstring
  :hook (python-mode . python-docstring-mode)
  :bind (:map python-mode-map
             ("M-q" . python-docstring-fill)))

(provide 'init-dev)
;;; init-dev.el ends here
