emacs/.emacs.d/README.org
*** Denote
:PROPERTIES:
:ID:       7fed44cb-7196-48f4-9708-b6012d1c6c5d
:END:

=denote= is an Emacs package that helps users manage and organize their notes
more effectively.

Related notes:
+ [[denote:20241010T181237][How To Use Denote]]

#+begin_src emacs-lisp
(use-package denote
  :defer t
  :after org
  :commands (denote denote-open-or-create)
  :hook ((dired-mode . denote-dired-mode)
         (text-mode . denote-fontify-links-mode-maybe))
  :custom
  (denote-directory (expand-file-name "notes" user-cloud-path))
  (denote-file-type "org")
  (denote-prompts '(title keywords))
  (denote-known-keywords '("emacs" "python" "linux" "ml" "work"))
  ;; TODO: add separate templates for coding/ect
  (denote-templates nil)
  (denote-org-front-matter (concat "#+TITLE: %1$s\n"
                                   "#+DATE: %2$s\n"
                                   "#+ID: %4$s\n"
                                   "#+FILETAGS: %3$s\n"
                                   "#+STARTUP: overview\n")))
#+end_src

*** Update dblocks Before Saving

=denote= takes advantage of dynamic =org-blocks= to dynamically organize links and
back-links. Annoyingly, they must be manually updated. Here, we add a hook to
update dynamic blocks before saving the =denote= buffer.

#+begin_src emacs-lisp
(add-hook 'before-save-hook (lambda ()
                              (when (denote-file-is-note-p (buffer-file-name))
                                (org-update-all-dblocks))))
#+end_src

*** Consult-Denote Extension
:PROPERTIES:
:ID:       614d6cd5-6eb8-40cc-8ed1-538bcdca253d
:END:
:RELATED:
+ [[id:8b393fcc-9d43-4afb-b249-9a72bc6089ea][Consult]]
:END:

=consult-denote= is an Emacs accessory package for =denote= that extends the
preview-functionality of =consult=.  The package provides the following
functions:

+ consult-denote-find :: Alternative to ~denote-open-or-create~
+ consult-denote-grep :: Regex to filter files in =denote-directory=

#+begin_src emacs-lisp
(use-package consult-denote
  :after (consult denote)
  :commands (consult-denote-find))
#+end_src

** TODO Latex
:LOGBOOK:
- State "TODO"       from              [2025-05-08 Thu 12:32]
  Need to figure out dependencies
:END:
*** auctex

=auctex= is an advanced editing environment for =LaTeX= and other =TeX=-related
formats in Emacs. Functionality provided includes syntax highlighting, command
completion, document navigation, error parsing, and preview functionality. *N.B.*
Prerequisites include:

+ texlive-most :: Collection of tools, programs, and libraries for =TeX= files
+ pdflatex :: =LaTex= engine that produces PDF files from ~.tex~ source files
+ ghostscript :: For operation of =preview-latex= in both =DVI=- and =PDF=-mode
+ mupdf :: lightweight PDF viewer (useful for previewing)

According to the [[https://elpa.gnu.org/packages/doc/auctex.html][documentation]], the following settings are recommended in order
to get support for many of the LaTeX packages commonly used in documents:
+ TeX-auto-save t :: Enable parse on save
+ TeX-parse-self t :: Enable parse on load
+ TeX-master nil :: Make =auctex= aware of multi-file document structure

Useful commands include:
+ M-x tex-compile :: Compile =.tex= buffer and view in PDF
+ M-x LaTeX-section :: ~C-c C-s~ to insert a template for a =LaTeX= section
+ M-x TeX-error-overview :: To see formatted list of compiler errors/warnings

#+begin_src emacs-lisp :tangle no
(use-package auctex
  :mode ("\\.tex\\'" . latex-mode)
  :hook ((tex-mode . jinx-mode)
         ;; Always generate PDF, not DVI file
         (tex-mode . (lambda ()
                       (setq-local TeX-PDF-mode 1))))
  :custom
  (TeX-auto-save t)
  (TeX-parse-self t)

  ;; Manually specify using 'pdf-tools' to view PDF files
  (TeX-view-program-selection '((output-pdf "PDF Tools")))
  :config
  (setq-default TeX-master nil))
#+end_src

*** pdf-tools

=pdf-tools= is an Emacs package extension that enhances PDF viewing and
interaction within Emacs. Instead of using an external view like =Zathura=, it
enables viewing and interacting within PDFs inside an Emacs buffer.

#+begin_src emacs-lisp :tangle no
(use-package pdf-tools
  :after (auctex)
  :config (pdf-tools-install))
#+end_src

** Provide init-writing.el

#+begin_src emacs-lisp
(provide 'init-writing)

;;; init-writing.el ends here
#+end_src

* Keybindings
:PROPERTIES:
:header-args: :tangle modules/init-kbd.el
:END:

#+begin_src emacs-lisp :noweb yes :comments no
<<header(FILENAME="init-kbd.el")>>
#+end_src

** Which-Key

=which-key= is an Emacs package providing the minor-mode =which-key-mode= that,
when activated, displays the available keybindings following an incomplete
command [[[https://github.com/justbur/emacs-which-key][github/whichkey]]]. For example, typing ~C-x~ will open a window showing
available keybindings (and descriptions) sharing the ~C-x~ prefix.

*N.B.* After popup window appears, use ~C-h~ to open additional navigation
options. This is helpful not all keybindings can fit in the popup window.

#+begin_src emacs-lisp
(use-package which-key
  :config (which-key-mode)
  :custom
  (which-key-show-early-on-C-h t     "Trigger which-key manually")
  (which-key-idle-delay 0.5          "Delay before popup appears")
  (which-key-idle-second-delay 0.05  "Responsiveness after triggered")
  (which-key-popup-type 'minibuffer  "Where to show which-key")
  (which-key-max-display-columns nil "N-cols determined from monotor")
  (which-key-separator "  "         "ex: C-x DEL backward-kill-sentence")
  (which-key-add-column-padding 1    "Padding between columns of keys")
  (which-key-show-remaining-keys t   "Show count of keys in modeline"))
#+end_src

** Crux
:PROPERTIES:
:ID:       28b8a358-e893-4390-a882-7239a36efcd4
:END:
:RELATED:
+ [[id:d831e4e4-e9b1-480e-aa1a-a152d9707275][General.el]]
:END:

=crux= ("Collection of Ridiculously Useful eXtensions") is an Emacs package that
bundles many useful interactive commands to enhance the Emacs experience. There
are many functions [[[https://github.com/bbatsov/crux/blob/master/crux.el][github.com/crux]]] to choose from.

Below, we add a number of useful functions:
  + crux-move-beginning-of-line :: Move point to indentation of line
  + crux-kill-line-backwards :: Kill line backwards and adjust the indentation
  + crux-switch-to-previous-buffer :: Switch to previously opened buffer
  + crux-view-url :: Open new buffer containing contents of URL

#+begin_src emacs-lisp
(use-package crux
  :commands (crux-move-beginning-of-line
             crux-kill-whole-line
             crux-switch-to-previous-buffer
             crux-kill-line-backwards)
  :bind (("C-a" . 'crux-move-beginning-of-line)
         ([remap kill-whole-line] . 'crux-kill-whole-line)
         ("M-o" . 'crux-switch-to-previous-buffer)
         ("C-<backspace>" . 'crux-kill-line-backwards)
         ("C-c 3" . 'crux-view-url)))
#+end_src

** Global Bindings
:PROPERTIES:
:ID:       77a39f08-8fcf-4b4f-b7c4-aef965d87cab
:END:
:RELATED:
+ [[id:d831e4e4-e9b1-480e-aa1a-a152d9707275][General.el]]
:END:

#+begin_src emacs-lisp
;; 'Find-File-At-Point' package adds additional functionality to
;; existing keybindings
(ffap-bindings)

(global-set-key (kbd "C-+") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "C-x O") 'my/jump-to-minibuffer)
(global-set-key (kbd "C-x M-k") 'kill-current-buffer)
#+end_src

** General.el
:PROPERTIES:
:ID:       d831e4e4-e9b1-480e-aa1a-a152d9707275
:END:
:RELATED:
+ [[id:453fdeac-b2bb-4217-9803-d5c89ceaf6de][Custom Buffer Functions]]
+ [[id:8f4885df-ad58-432b-a6cd-1f4524bfc868][Custom Functions]]
+ [[id:28b8a358-e893-4390-a882-7239a36efcd4][Crux]]
+ [[id:77a39f08-8fcf-4b4f-b7c4-aef965d87cab][Global Bindings]]
:END:

=general= is an Emacs package is a keybinding management library that allows
users to setup global and local keybindings more easily.

*** Basic Config

#+begin_src emacs-lisp
(use-package general
  :custom
  (general-describe-priority-keymaps nil)
  (general-describe-keymap-sort-function 'general-sort-by-car)
  (general-describe-keybinding-sort-function 'general-sort-by-car)

  :config
  ;; Good to unset before assigning to 'my-leader-def'
  (global-unset-key (kbd "M-m"))

  (general-create-definer my-leader-def
    :keymaps 'global
    :prefix "M-m"))
#+end_src

*** General: Buffers

#+begin_src emacs-lisp
(my-leader-def
  "b"  '(:ignore t                        :which-key "buffers")
  "bn" '(my/kill-buffer-name              :which-key "copy-buff-name")
  "bp" '(my/kill-relative-buffer-path     :which-key "copy-buff-path")
  "bl" '(my/kill-buffer-orgmode-file-link :which-key "copy-orglink")
  "bk" '(my/kill-all-buffers-except-scratch :which-key "kill-buffers-except-scratch")
  "bk" '(crux-kill-other-buffers            :which-key "crux-kill-other-buffers"))
#+end_src

*** General: Files

#+begin_src emacs-lisp
(my-leader-def
  "f"  '(:ignore t                :which-key "file")
  "fi" '(crux-find-user-init-file :which-key "jump-to-init")
  "fc" '(my/find-config-file      :which-key "jump-to-config")
  "ff" '(ffap-other-window        :which-key "find-file-other-window")
  "fp" '(projectile-find-file-other-window :which-key "find-proj-file-other-window"))
#+end_src

*** General: Images

#+begin_src emacs-lisp
(my-leader-def
  "i"  '(:ignore t :which-key "images")
  "ic" '(jh/screenshot-copy-to-persist-fig-dir    :which-key "copy-screenshot")
  "io" '(jh/screenshot-select-and-insert-org-link :which-key "insert-screenshot")
  "ii" '(jh/screenshot-copy-and-insert-latest     :which-key "copy-insert-screenshot"))
#+end_src

*** General: Python


#+begin_src emacs-lisp
(my-leader-def
  :keymaps '(python-mode-map)
  "p"   '(:ignore t         :which-key "python")
  "pd"  '(:ignore t         :whick-key "docstring")
  "pdn" '(numpydoc-generate :which-key "numpy-docstr")
  "pds" '(sphinx-doc        :which-key "sphinx-docstr")
  "pdf" '((lambda ()
            (interactive)
            (numpydoc--fill-last-insertion))
          :which-key "numpydoc-fill-paragraph"))
#+end_src

** Provide init-kbd.el

#+begin_src emacs-lisp
(provide 'init-kbd)
;;; init-kbd.el ends here
#+end_src

* Load Modules
:PROPERTIES:
:ID:       8b5ba82d-d303-4970-ade6-39f82fc08b56
:header-args: :tangle init.el
:END:

Finally, we specify the packages (ie top-level org-headers) to be included in
our configuration.

#+begin_src emacs-lisp
  (add-to-list 'load-path (expand-file-name "modules" user-emacs-directory))

  (require 'init-emacs)
  (require 'init-ui)
  (require 'init-org)
  (require 'init-completion)
  (require 'init-dired)
  (require 'init-dev)
  (require 'init-writing)
  (require 'init-kbd)
  ;;; init.el ends here
#+end_src
