emacs/.emacs.d/init.el

  (require 'init-emacs)
  (require 'init-ui)
  (require 'init-org)
  (require 'init-completion)
  (require 'init-dired)
  (require 'init-dev)
  (require 'init-writing)
  (require 'init-kbd)
  ;;; init.el ends here
