stow/emacs/.emacs.d/modules/init-writing.el

(use-package denote
  :defer t
  :after org
  :commands (denote denote-open-or-create)
  :hook ((dired-mode . denote-dired-mode)
         (text-mode . denote-fontify-links-mode-maybe))
  :custom
  (denote-directory (expand-file-name "notes" user-cloud-path))
  (denote-file-type "org")
  (denote-prompts '(title keywords))
  (denote-known-keywords '("emacs" "python" "linux" "ml" "work"))
  ;; TODO: add separate templates for coding/ect
  (denote-templates nil)
  (denote-org-front-matter (concat "#+TITLE: %1$s\n"
                                   "#+DATE: %2$s\n"
                                   "#+ID: %4$s\n"
                                   "#+FILETAGS: %3$s\n"
                                   "#+STARTUP: overview\n")))

(add-hook 'before-save-hook (lambda ()
                              (when (denote-file-is-note-p (buffer-file-name))
                                (org-update-all-dblocks))))

(use-package consult-denote
  :after (consult denote)
  :commands (consult-denote-find))

(provide 'init-writing)

;;; init-writing.el ends here
